GopalSaraf/Practicals/PSDL/include/proc/pic18f95j94.inc
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
LCDDATA20                                equ 0EA2h
// bitfield definitions
LCDDATA20_S32C2_POSN                     equ 0000h
LCDDATA20_S32C2_POSITION                 equ 0000h
LCDDATA20_S32C2_SIZE                     equ 0001h
LCDDATA20_S32C2_LENGTH                   equ 0001h
LCDDATA20_S32C2_MASK                     equ 0001h
LCDDATA20_S33C2_POSN                     equ 0001h
LCDDATA20_S33C2_POSITION                 equ 0001h
LCDDATA20_S33C2_SIZE                     equ 0001h
LCDDATA20_S33C2_LENGTH                   equ 0001h
LCDDATA20_S33C2_MASK                     equ 0002h
LCDDATA20_S34C2_POSN                     equ 0002h
LCDDATA20_S34C2_POSITION                 equ 0002h
LCDDATA20_S34C2_SIZE                     equ 0001h
LCDDATA20_S34C2_LENGTH                   equ 0001h
LCDDATA20_S34C2_MASK                     equ 0004h
LCDDATA20_S35C2_POSN                     equ 0003h
LCDDATA20_S35C2_POSITION                 equ 0003h
LCDDATA20_S35C2_SIZE                     equ 0001h
LCDDATA20_S35C2_LENGTH                   equ 0001h
LCDDATA20_S35C2_MASK                     equ 0008h
LCDDATA20_S36C2_POSN                     equ 0004h
LCDDATA20_S36C2_POSITION                 equ 0004h
LCDDATA20_S36C2_SIZE                     equ 0001h
LCDDATA20_S36C2_LENGTH                   equ 0001h
LCDDATA20_S36C2_MASK                     equ 0010h
LCDDATA20_S37C2_POSN                     equ 0005h
LCDDATA20_S37C2_POSITION                 equ 0005h
LCDDATA20_S37C2_SIZE                     equ 0001h
LCDDATA20_S37C2_LENGTH                   equ 0001h
LCDDATA20_S37C2_MASK                     equ 0020h
LCDDATA20_S38C2_POSN                     equ 0006h
LCDDATA20_S38C2_POSITION                 equ 0006h
LCDDATA20_S38C2_SIZE                     equ 0001h
LCDDATA20_S38C2_LENGTH                   equ 0001h
LCDDATA20_S38C2_MASK                     equ 0040h
LCDDATA20_S39C2_POSN                     equ 0007h
LCDDATA20_S39C2_POSITION                 equ 0007h
LCDDATA20_S39C2_SIZE                     equ 0001h
LCDDATA20_S39C2_LENGTH                   equ 0001h
LCDDATA20_S39C2_MASK                     equ 0080h

// Register: LCDDATA21
#define LCDDATA21 LCDDATA21
LCDDATA21                                equ 0EA3h
// bitfield definitions
LCDDATA21_S40C2_POSN                     equ 0000h
LCDDATA21_S40C2_POSITION                 equ 0000h
LCDDATA21_S40C2_SIZE                     equ 0001h
LCDDATA21_S40C2_LENGTH                   equ 0001h
LCDDATA21_S40C2_MASK                     equ 0001h
LCDDATA21_S41C2_POSN                     equ 0001h
LCDDATA21_S41C2_POSITION                 equ 0001h
LCDDATA21_S41C2_SIZE                     equ 0001h
LCDDATA21_S41C2_LENGTH                   equ 0001h
LCDDATA21_S41C2_MASK                     equ 0002h
LCDDATA21_S42C2_POSN                     equ 0002h
LCDDATA21_S42C2_POSITION                 equ 0002h
LCDDATA21_S42C2_SIZE                     equ 0001h
LCDDATA21_S42C2_LENGTH                   equ 0001h
LCDDATA21_S42C2_MASK                     equ 0004h
LCDDATA21_S43C2_POSN                     equ 0003h
LCDDATA21_S43C2_POSITION                 equ 0003h
LCDDATA21_S43C2_SIZE                     equ 0001h
LCDDATA21_S43C2_LENGTH                   equ 0001h
LCDDATA21_S43C2_MASK                     equ 0008h
LCDDATA21_S44C2_POSN                     equ 0004h
LCDDATA21_S44C2_POSITION                 equ 0004h
LCDDATA21_S44C2_SIZE                     equ 0001h
LCDDATA21_S44C2_LENGTH                   equ 0001h
LCDDATA21_S44C2_MASK                     equ 0010h
LCDDATA21_S45C2_POSN                     equ 0005h
LCDDATA21_S45C2_POSITION                 equ 0005h
LCDDATA21_S45C2_SIZE                     equ 0001h
LCDDATA21_S45C2_LENGTH                   equ 0001h
LCDDATA21_S45C2_MASK                     equ 0020h
LCDDATA21_S46C2_POSN                     equ 0006h
LCDDATA21_S46C2_POSITION                 equ 0006h
LCDDATA21_S46C2_SIZE                     equ 0001h
LCDDATA21_S46C2_LENGTH                   equ 0001h
LCDDATA21_S46C2_MASK                     equ 0040h
LCDDATA21_S47C2_POSN                     equ 0007h
LCDDATA21_S47C2_POSITION                 equ 0007h
LCDDATA21_S47C2_SIZE                     equ 0001h
LCDDATA21_S47C2_LENGTH                   equ 0001h
LCDDATA21_S47C2_MASK                     equ 0080h

// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
LCDDATA22                                equ 0EA4h
// bitfield definitions
LCDDATA22_S48C2_POSN                     equ 0000h
LCDDATA22_S48C2_POSITION                 equ 0000h
LCDDATA22_S48C2_SIZE                     equ 0001h
LCDDATA22_S48C2_LENGTH                   equ 0001h
LCDDATA22_S48C2_MASK                     equ 0001h
LCDDATA22_S49C2_POSN                     equ 0001h
LCDDATA22_S49C2_POSITION                 equ 0001h
LCDDATA22_S49C2_SIZE                     equ 0001h
LCDDATA22_S49C2_LENGTH                   equ 0001h
LCDDATA22_S49C2_MASK                     equ 0002h
LCDDATA22_S50C2_POSN                     equ 0002h
LCDDATA22_S50C2_POSITION                 equ 0002h
LCDDATA22_S50C2_SIZE                     equ 0001h
LCDDATA22_S50C2_LENGTH                   equ 0001h
LCDDATA22_S50C2_MASK                     equ 0004h
LCDDATA22_S51C2_POSN                     equ 0003h
LCDDATA22_S51C2_POSITION                 equ 0003h
LCDDATA22_S51C2_SIZE                     equ 0001h
LCDDATA22_S51C2_LENGTH                   equ 0001h
LCDDATA22_S51C2_MASK                     equ 0008h
LCDDATA22_S52C2_POSN                     equ 0004h
LCDDATA22_S52C2_POSITION                 equ 0004h
LCDDATA22_S52C2_SIZE                     equ 0001h
LCDDATA22_S52C2_LENGTH                   equ 0001h
LCDDATA22_S52C2_MASK                     equ 0010h
LCDDATA22_S53C2_POSN                     equ 0005h
LCDDATA22_S53C2_POSITION                 equ 0005h
LCDDATA22_S53C2_SIZE                     equ 0001h
LCDDATA22_S53C2_LENGTH                   equ 0001h
LCDDATA22_S53C2_MASK                     equ 0020h
LCDDATA22_S54C2_POSN                     equ 0006h
LCDDATA22_S54C2_POSITION                 equ 0006h
LCDDATA22_S54C2_SIZE                     equ 0001h
LCDDATA22_S54C2_LENGTH                   equ 0001h
LCDDATA22_S54C2_MASK                     equ 0040h
LCDDATA22_S55C2_POSN                     equ 0007h
LCDDATA22_S55C2_POSITION                 equ 0007h
LCDDATA22_S55C2_SIZE                     equ 0001h
LCDDATA22_S55C2_LENGTH                   equ 0001h
LCDDATA22_S55C2_MASK                     equ 0080h

// Register: LCDDATA23
#define LCDDATA23 LCDDATA23
LCDDATA23                                equ 0EA5h
// bitfield definitions
LCDDATA23_S56C2_POSN                     equ 0000h
LCDDATA23_S56C2_POSITION                 equ 0000h
LCDDATA23_S56C2_SIZE                     equ 0001h
LCDDATA23_S56C2_LENGTH                   equ 0001h
LCDDATA23_S56C2_MASK                     equ 0001h
LCDDATA23_S57C2_POSN                     equ 0001h
LCDDATA23_S57C2_POSITION                 equ 0001h
LCDDATA23_S57C2_SIZE                     equ 0001h
LCDDATA23_S57C2_LENGTH                   equ 0001h
LCDDATA23_S57C2_MASK                     equ 0002h
LCDDATA23_S58C2_POSN                     equ 0002h
LCDDATA23_S58C2_POSITION                 equ 0002h
LCDDATA23_S58C2_SIZE                     equ 0001h
LCDDATA23_S58C2_LENGTH                   equ 0001h
LCDDATA23_S58C2_MASK                     equ 0004h
LCDDATA23_S59C2_POSN                     equ 0003h
LCDDATA23_S59C2_POSITION                 equ 0003h
LCDDATA23_S59C2_SIZE                     equ 0001h
LCDDATA23_S59C2_LENGTH                   equ 0001h
LCDDATA23_S59C2_MASK                     equ 0008h
LCDDATA23_S60C2_POSN                     equ 0004h
LCDDATA23_S60C2_POSITION                 equ 0004h
LCDDATA23_S60C2_SIZE                     equ 0001h
LCDDATA23_S60C2_LENGTH                   equ 0001h
LCDDATA23_S60C2_MASK                     equ 0010h
LCDDATA23_S61C2_POSN                     equ 0005h
LCDDATA23_S61C2_POSITION                 equ 0005h
LCDDATA23_S61C2_SIZE                     equ 0001h
LCDDATA23_S61C2_LENGTH                   equ 0001h
LCDDATA23_S61C2_MASK                     equ 0020h
LCDDATA23_S62C2_POSN                     equ 0006h
LCDDATA23_S62C2_POSITION                 equ 0006h
LCDDATA23_S62C2_SIZE                     equ 0001h
LCDDATA23_S62C2_LENGTH                   equ 0001h
LCDDATA23_S62C2_MASK                     equ 0040h
LCDDATA23_S63C2_POSN                     equ 0007h
LCDDATA23_S63C2_POSITION                 equ 0007h
LCDDATA23_S63C2_SIZE                     equ 0001h
LCDDATA23_S63C2_LENGTH                   equ 0001h
LCDDATA23_S63C2_MASK                     equ 0080h

// Register: LCDDATA24
#define LCDDATA24 LCDDATA24
LCDDATA24                                equ 0EA6h
// bitfield definitions
LCDDATA24_S00C3_POSN                     equ 0000h
LCDDATA24_S00C3_POSITION                 equ 0000h
LCDDATA24_S00C3_SIZE                     equ 0001h
LCDDATA24_S00C3_LENGTH                   equ 0001h
LCDDATA24_S00C3_MASK                     equ 0001h
LCDDATA24_S01C3_POSN                     equ 0001h
LCDDATA24_S01C3_POSITION                 equ 0001h
LCDDATA24_S01C3_SIZE                     equ 0001h
LCDDATA24_S01C3_LENGTH                   equ 0001h
LCDDATA24_S01C3_MASK                     equ 0002h
LCDDATA24_S02C3_POSN                     equ 0002h
LCDDATA24_S02C3_POSITION                 equ 0002h
LCDDATA24_S02C3_SIZE                     equ 0001h
LCDDATA24_S02C3_LENGTH                   equ 0001h
LCDDATA24_S02C3_MASK                     equ 0004h
LCDDATA24_S03C3_POSN                     equ 0003h
LCDDATA24_S03C3_POSITION                 equ 0003h
LCDDATA24_S03C3_SIZE                     equ 0001h
LCDDATA24_S03C3_LENGTH                   equ 0001h
LCDDATA24_S03C3_MASK                     equ 0008h
LCDDATA24_S04C3_POSN                     equ 0004h
LCDDATA24_S04C3_POSITION                 equ 0004h
LCDDATA24_S04C3_SIZE                     equ 0001h
LCDDATA24_S04C3_LENGTH                   equ 0001h
LCDDATA24_S04C3_MASK                     equ 0010h
LCDDATA24_S05C3_POSN                     equ 0005h
LCDDATA24_S05C3_POSITION                 equ 0005h
LCDDATA24_S05C3_SIZE                     equ 0001h
LCDDATA24_S05C3_LENGTH                   equ 0001h
LCDDATA24_S05C3_MASK                     equ 0020h
LCDDATA24_S06C3_POSN                     equ 0006h
LCDDATA24_S06C3_POSITION                 equ 0006h
LCDDATA24_S06C3_SIZE                     equ 0001h
LCDDATA24_S06C3_LENGTH                   equ 0001h
LCDDATA24_S06C3_MASK                     equ 0040h
LCDDATA24_S07C3_POSN                     equ 0007h
LCDDATA24_S07C3_POSITION                 equ 0007h
LCDDATA24_S07C3_SIZE                     equ 0001h
LCDDATA24_S07C3_LENGTH                   equ 0001h
LCDDATA24_S07C3_MASK                     equ 0080h

// Register: LCDDATA25
#define LCDDATA25 LCDDATA25
LCDDATA25                                equ 0EA7h
// bitfield definitions
LCDDATA25_S08C3_POSN                     equ 0000h
LCDDATA25_S08C3_POSITION                 equ 0000h
LCDDATA25_S08C3_SIZE                     equ 0001h
LCDDATA25_S08C3_LENGTH                   equ 0001h
LCDDATA25_S08C3_MASK                     equ 0001h
LCDDATA25_S09C3_POSN                     equ 0001h
LCDDATA25_S09C3_POSITION                 equ 0001h
LCDDATA25_S09C3_SIZE                     equ 0001h
LCDDATA25_S09C3_LENGTH                   equ 0001h
LCDDATA25_S09C3_MASK                     equ 0002h
LCDDATA25_S10C3_POSN                     equ 0002h
LCDDATA25_S10C3_POSITION                 equ 0002h
LCDDATA25_S10C3_SIZE                     equ 0001h
LCDDATA25_S10C3_LENGTH                   equ 0001h
LCDDATA25_S10C3_MASK                     equ 0004h
LCDDATA25_S11C3_POSN                     equ 0003h
LCDDATA25_S11C3_POSITION                 equ 0003h
LCDDATA25_S11C3_SIZE                     equ 0001h
LCDDATA25_S11C3_LENGTH                   equ 0001h
LCDDATA25_S11C3_MASK                     equ 0008h
LCDDATA25_S12C3_POSN                     equ 0004h
LCDDATA25_S12C3_POSITION                 equ 0004h
LCDDATA25_S12C3_SIZE                     equ 0001h
LCDDATA25_S12C3_LENGTH                   equ 0001h
LCDDATA25_S12C3_MASK                     equ 0010h
LCDDATA25_S13C3_POSN                     equ 0005h
LCDDATA25_S13C3_POSITION                 equ 0005h
LCDDATA25_S13C3_SIZE                     equ 0001h
LCDDATA25_S13C3_LENGTH                   equ 0001h
LCDDATA25_S13C3_MASK                     equ 0020h
LCDDATA25_S14C3_POSN                     equ 0006h
LCDDATA25_S14C3_POSITION                 equ 0006h
LCDDATA25_S14C3_SIZE                     equ 0001h
LCDDATA25_S14C3_LENGTH                   equ 0001h
LCDDATA25_S14C3_MASK                     equ 0040h
LCDDATA25_S15C3_POSN                     equ 0007h
LCDDATA25_S15C3_POSITION                 equ 0007h
LCDDATA25_S15C3_SIZE                     equ 0001h
LCDDATA25_S15C3_LENGTH                   equ 0001h
LCDDATA25_S15C3_MASK                     equ 0080h

// Register: LCDDATA26
#define LCDDATA26 LCDDATA26
LCDDATA26                                equ 0EA8h
// bitfield definitions
LCDDATA26_S16C3_POSN                     equ 0000h
LCDDATA26_S16C3_POSITION                 equ 0000h
LCDDATA26_S16C3_SIZE                     equ 0001h
LCDDATA26_S16C3_LENGTH                   equ 0001h
LCDDATA26_S16C3_MASK                     equ 0001h
LCDDATA26_S17C3_POSN                     equ 0001h
LCDDATA26_S17C3_POSITION                 equ 0001h
LCDDATA26_S17C3_SIZE                     equ 0001h
LCDDATA26_S17C3_LENGTH                   equ 0001h
LCDDATA26_S17C3_MASK                     equ 0002h
LCDDATA26_S18C3_POSN                     equ 0002h
LCDDATA26_S18C3_POSITION                 equ 0002h
LCDDATA26_S18C3_SIZE                     equ 0001h
LCDDATA26_S18C3_LENGTH                   equ 0001h
LCDDATA26_S18C3_MASK                     equ 0004h
LCDDATA26_S19C3_POSN                     equ 0003h
LCDDATA26_S19C3_POSITION                 equ 0003h
LCDDATA26_S19C3_SIZE                     equ 0001h
LCDDATA26_S19C3_LENGTH                   equ 0001h
LCDDATA26_S19C3_MASK                     equ 0008h
LCDDATA26_S20C3_POSN                     equ 0004h
LCDDATA26_S20C3_POSITION                 equ 0004h
LCDDATA26_S20C3_SIZE                     equ 0001h
LCDDATA26_S20C3_LENGTH                   equ 0001h
LCDDATA26_S20C3_MASK                     equ 0010h
LCDDATA26_S21C3_POSN                     equ 0005h
LCDDATA26_S21C3_POSITION                 equ 0005h
LCDDATA26_S21C3_SIZE                     equ 0001h
LCDDATA26_S21C3_LENGTH                   equ 0001h
LCDDATA26_S21C3_MASK                     equ 0020h
LCDDATA26_S22C3_POSN                     equ 0006h
LCDDATA26_S22C3_POSITION                 equ 0006h
LCDDATA26_S22C3_SIZE                     equ 0001h
LCDDATA26_S22C3_LENGTH                   equ 0001h
LCDDATA26_S22C3_MASK                     equ 0040h
LCDDATA26_S23C3_POSN                     equ 0007h
LCDDATA26_S23C3_POSITION                 equ 0007h
LCDDATA26_S23C3_SIZE                     equ 0001h
LCDDATA26_S23C3_LENGTH                   equ 0001h
LCDDATA26_S23C3_MASK                     equ 0080h

// Register: LCDDATA27
#define LCDDATA27 LCDDATA27
LCDDATA27                                equ 0EA9h
// bitfield definitions
LCDDATA27_S24C3_POSN                     equ 0000h
LCDDATA27_S24C3_POSITION                 equ 0000h
LCDDATA27_S24C3_SIZE                     equ 0001h
LCDDATA27_S24C3_LENGTH                   equ 0001h
LCDDATA27_S24C3_MASK                     equ 0001h
LCDDATA27_S25C3_POSN                     equ 0001h
LCDDATA27_S25C3_POSITION                 equ 0001h
LCDDATA27_S25C3_SIZE                     equ 0001h
LCDDATA27_S25C3_LENGTH                   equ 0001h
LCDDATA27_S25C3_MASK                     equ 0002h
LCDDATA27_S26C3_POSN                     equ 0002h
LCDDATA27_S26C3_POSITION                 equ 0002h
LCDDATA27_S26C3_SIZE                     equ 0001h
LCDDATA27_S26C3_LENGTH                   equ 0001h
LCDDATA27_S26C3_MASK                     equ 0004h
LCDDATA27_S27C3_POSN                     equ 0003h
LCDDATA27_S27C3_POSITION                 equ 0003h
LCDDATA27_S27C3_SIZE                     equ 0001h
LCDDATA27_S27C3_LENGTH                   equ 0001h
LCDDATA27_S27C3_MASK                     equ 0008h
LCDDATA27_S28C3_POSN                     equ 0004h
LCDDATA27_S28C3_POSITION                 equ 0004h
LCDDATA27_S28C3_SIZE                     equ 0001h
LCDDATA27_S28C3_LENGTH                   equ 0001h
LCDDATA27_S28C3_MASK                     equ 0010h
LCDDATA27_S29C3_POSN                     equ 0005h
LCDDATA27_S29C3_POSITION                 equ 0005h
LCDDATA27_S29C3_SIZE                     equ 0001h
LCDDATA27_S29C3_LENGTH                   equ 0001h
LCDDATA27_S29C3_MASK                     equ 0020h
LCDDATA27_S30C3_POSN                     equ 0006h
LCDDATA27_S30C3_POSITION                 equ 0006h
LCDDATA27_S30C3_SIZE                     equ 0001h
LCDDATA27_S30C3_LENGTH                   equ 0001h
LCDDATA27_S30C3_MASK                     equ 0040h
LCDDATA27_S31C3_POSN                     equ 0007h
LCDDATA27_S31C3_POSITION                 equ 0007h
LCDDATA27_S31C3_SIZE                     equ 0001h
LCDDATA27_S31C3_LENGTH                   equ 0001h
LCDDATA27_S31C3_MASK                     equ 0080h

// Register: LCDDATA28
#define LCDDATA28 LCDDATA28
LCDDATA28                                equ 0EAAh
// bitfield definitions
LCDDATA28_S32C3_POSN                     equ 0000h
LCDDATA28_S32C3_POSITION                 equ 0000h
LCDDATA28_S32C3_SIZE                     equ 0001h
LCDDATA28_S32C3_LENGTH                   equ 0001h
LCDDATA28_S32C3_MASK                     equ 0001h
LCDDATA28_S33C3_POSN                     equ 0001h
LCDDATA28_S33C3_POSITION                 equ 0001h
LCDDATA28_S33C3_SIZE                     equ 0001h
LCDDATA28_S33C3_LENGTH                   equ 0001h
LCDDATA28_S33C3_MASK                     equ 0002h
LCDDATA28_S34C3_POSN                     equ 0002h
LCDDATA28_S34C3_POSITION                 equ 0002h
LCDDATA28_S34C3_SIZE                     equ 0001h
LCDDATA28_S34C3_LENGTH                   equ 0001h
LCDDATA28_S34C3_MASK                     equ 0004h
LCDDATA28_S35C3_POSN                     equ 0003h
LCDDATA28_S35C3_POSITION                 equ 0003h
LCDDATA28_S35C3_SIZE                     equ 0001h
LCDDATA28_S35C3_LENGTH                   equ 0001h
LCDDATA28_S35C3_MASK                     equ 0008h
LCDDATA28_S36C3_POSN                     equ 0004h
LCDDATA28_S36C3_POSITION                 equ 0004h
LCDDATA28_S36C3_SIZE                     equ 0001h
LCDDATA28_S36C3_LENGTH                   equ 0001h
LCDDATA28_S36C3_MASK                     equ 0010h
LCDDATA28_S37C3_POSN                     equ 0005h
LCDDATA28_S37C3_POSITION                 equ 0005h
LCDDATA28_S37C3_SIZE                     equ 0001h
LCDDATA28_S37C3_LENGTH                   equ 0001h
LCDDATA28_S37C3_MASK                     equ 0020h
LCDDATA28_S38C3_POSN                     equ 0006h
LCDDATA28_S38C3_POSITION                 equ 0006h
LCDDATA28_S38C3_SIZE                     equ 0001h
LCDDATA28_S38C3_LENGTH                   equ 0001h
LCDDATA28_S38C3_MASK                     equ 0040h
LCDDATA28_S39C3_POSN                     equ 0007h
LCDDATA28_S39C3_POSITION                 equ 0007h
LCDDATA28_S39C3_SIZE                     equ 0001h
LCDDATA28_S39C3_LENGTH                   equ 0001h
LCDDATA28_S39C3_MASK                     equ 0080h

