GopalSaraf/Practicals/PSDL/include/proc/pic18f95j94.inc
// Register: ODCON1
#define ODCON1 ODCON1
ODCON1                                   equ 0EEBh
// bitfield definitions
ODCON1_SSP1OD_POSN                       equ 0000h
ODCON1_SSP1OD_POSITION                   equ 0000h
ODCON1_SSP1OD_SIZE                       equ 0001h
ODCON1_SSP1OD_LENGTH                     equ 0001h
ODCON1_SSP1OD_MASK                       equ 0001h
ODCON1_SSP2OD_POSN                       equ 0001h
ODCON1_SSP2OD_POSITION                   equ 0001h
ODCON1_SSP2OD_SIZE                       equ 0001h
ODCON1_SSP2OD_LENGTH                     equ 0001h
ODCON1_SSP2OD_MASK                       equ 0002h
ODCON1_USART1OD_POSN                     equ 0002h
ODCON1_USART1OD_POSITION                 equ 0002h
ODCON1_USART1OD_SIZE                     equ 0001h
ODCON1_USART1OD_LENGTH                   equ 0001h
ODCON1_USART1OD_MASK                     equ 0004h
ODCON1_USART2OD_POSN                     equ 0003h
ODCON1_USART2OD_POSITION                 equ 0003h
ODCON1_USART2OD_SIZE                     equ 0001h
ODCON1_USART2OD_LENGTH                   equ 0001h
ODCON1_USART2OD_MASK                     equ 0008h
ODCON1_USART3OD_POSN                     equ 0004h
ODCON1_USART3OD_POSITION                 equ 0004h
ODCON1_USART3OD_SIZE                     equ 0001h
ODCON1_USART3OD_LENGTH                   equ 0001h
ODCON1_USART3OD_MASK                     equ 0010h
ODCON1_USART4OD_POSN                     equ 0005h
ODCON1_USART4OD_POSITION                 equ 0005h
ODCON1_USART4OD_SIZE                     equ 0001h
ODCON1_USART4OD_LENGTH                   equ 0001h
ODCON1_USART4OD_MASK                     equ 0020h
ODCON1_ECCP1OD_POSN                      equ 0006h
ODCON1_ECCP1OD_POSITION                  equ 0006h
ODCON1_ECCP1OD_SIZE                      equ 0001h
ODCON1_ECCP1OD_LENGTH                    equ 0001h
ODCON1_ECCP1OD_MASK                      equ 0040h
ODCON1_ECCP2OD_POSN                      equ 0007h
ODCON1_ECCP2OD_POSITION                  equ 0007h
ODCON1_ECCP2OD_SIZE                      equ 0001h
ODCON1_ECCP2OD_LENGTH                    equ 0001h
ODCON1_ECCP2OD_MASK                      equ 0080h

// Register: MDCARL
#define MDCARL MDCARL
MDCARL                                   equ 0EECh
// bitfield definitions
MDCARL_MDCL_POSN                         equ 0000h
MDCARL_MDCL_POSITION                     equ 0000h
MDCARL_MDCL_SIZE                         equ 0004h
MDCARL_MDCL_LENGTH                       equ 0004h
MDCARL_MDCL_MASK                         equ 000Fh
MDCARL_MDCLSYNC_POSN                     equ 0005h
MDCARL_MDCLSYNC_POSITION                 equ 0005h
MDCARL_MDCLSYNC_SIZE                     equ 0001h
MDCARL_MDCLSYNC_LENGTH                   equ 0001h
MDCARL_MDCLSYNC_MASK                     equ 0020h
MDCARL_MDCLPOL_POSN                      equ 0006h
MDCARL_MDCLPOL_POSITION                  equ 0006h
MDCARL_MDCLPOL_SIZE                      equ 0001h
MDCARL_MDCLPOL_LENGTH                    equ 0001h
MDCARL_MDCLPOL_MASK                      equ 0040h
MDCARL_MDCLODIS_POSN                     equ 0007h
MDCARL_MDCLODIS_POSITION                 equ 0007h
MDCARL_MDCLODIS_SIZE                     equ 0001h
MDCARL_MDCLODIS_LENGTH                   equ 0001h
MDCARL_MDCLODIS_MASK                     equ 0080h
MDCARL_MDCL0_POSN                        equ 0000h
MDCARL_MDCL0_POSITION                    equ 0000h
MDCARL_MDCL0_SIZE                        equ 0001h
MDCARL_MDCL0_LENGTH                      equ 0001h
MDCARL_MDCL0_MASK                        equ 0001h
MDCARL_MDCL1_POSN                        equ 0001h
MDCARL_MDCL1_POSITION                    equ 0001h
MDCARL_MDCL1_SIZE                        equ 0001h
MDCARL_MDCL1_LENGTH                      equ 0001h
MDCARL_MDCL1_MASK                        equ 0002h
MDCARL_MDCL2_POSN                        equ 0002h
MDCARL_MDCL2_POSITION                    equ 0002h
MDCARL_MDCL2_SIZE                        equ 0001h
MDCARL_MDCL2_LENGTH                      equ 0001h
MDCARL_MDCL2_MASK                        equ 0004h
MDCARL_MDCL3_POSN                        equ 0003h
MDCARL_MDCL3_POSITION                    equ 0003h
MDCARL_MDCL3_SIZE                        equ 0001h
MDCARL_MDCL3_LENGTH                      equ 0001h
MDCARL_MDCL3_MASK                        equ 0008h

// Register: MDCARH
#define MDCARH MDCARH
MDCARH                                   equ 0EEDh
// bitfield definitions
MDCARH_MDCH_POSN                         equ 0000h
MDCARH_MDCH_POSITION                     equ 0000h
MDCARH_MDCH_SIZE                         equ 0004h
MDCARH_MDCH_LENGTH                       equ 0004h
MDCARH_MDCH_MASK                         equ 000Fh
MDCARH_MDCHSYNC_POSN                     equ 0005h
MDCARH_MDCHSYNC_POSITION                 equ 0005h
MDCARH_MDCHSYNC_SIZE                     equ 0001h
MDCARH_MDCHSYNC_LENGTH                   equ 0001h
MDCARH_MDCHSYNC_MASK                     equ 0020h
MDCARH_MDCHPOL_POSN                      equ 0006h
MDCARH_MDCHPOL_POSITION                  equ 0006h
MDCARH_MDCHPOL_SIZE                      equ 0001h
MDCARH_MDCHPOL_LENGTH                    equ 0001h
MDCARH_MDCHPOL_MASK                      equ 0040h
MDCARH_MDCHODIS_POSN                     equ 0007h
MDCARH_MDCHODIS_POSITION                 equ 0007h
MDCARH_MDCHODIS_SIZE                     equ 0001h
MDCARH_MDCHODIS_LENGTH                   equ 0001h
MDCARH_MDCHODIS_MASK                     equ 0080h
MDCARH_MDCH0_POSN                        equ 0000h
MDCARH_MDCH0_POSITION                    equ 0000h
MDCARH_MDCH0_SIZE                        equ 0001h
MDCARH_MDCH0_LENGTH                      equ 0001h
MDCARH_MDCH0_MASK                        equ 0001h
MDCARH_MDCH1_POSN                        equ 0001h
MDCARH_MDCH1_POSITION                    equ 0001h
MDCARH_MDCH1_SIZE                        equ 0001h
MDCARH_MDCH1_LENGTH                      equ 0001h
MDCARH_MDCH1_MASK                        equ 0002h
MDCARH_MDCH2_POSN                        equ 0002h
MDCARH_MDCH2_POSITION                    equ 0002h
MDCARH_MDCH2_SIZE                        equ 0001h
MDCARH_MDCH2_LENGTH                      equ 0001h
MDCARH_MDCH2_MASK                        equ 0004h
MDCARH_MDCH3_POSN                        equ 0003h
MDCARH_MDCH3_POSITION                    equ 0003h
MDCARH_MDCH3_SIZE                        equ 0001h
MDCARH_MDCH3_LENGTH                      equ 0001h
MDCARH_MDCH3_MASK                        equ 0008h

