GopalSaraf/Practicals/PSDL/include/proc/pic18f95j94.inc
// Register: CM2CON
#define CM2CON CM2CON
CM2CON                                   equ 0F38h
// bitfield definitions
CM2CON_CCH_POSN                          equ 0000h
CM2CON_CCH_POSITION                      equ 0000h
CM2CON_CCH_SIZE                          equ 0002h
CM2CON_CCH_LENGTH                        equ 0002h
CM2CON_CCH_MASK                          equ 0003h
CM2CON_CREF_POSN                         equ 0002h
CM2CON_CREF_POSITION                     equ 0002h
CM2CON_CREF_SIZE                         equ 0001h
CM2CON_CREF_LENGTH                       equ 0001h
CM2CON_CREF_MASK                         equ 0004h
CM2CON_EVPOL_POSN                        equ 0003h
CM2CON_EVPOL_POSITION                    equ 0003h
CM2CON_EVPOL_SIZE                        equ 0002h
CM2CON_EVPOL_LENGTH                      equ 0002h
CM2CON_EVPOL_MASK                        equ 0018h
CM2CON_CPOL_POSN                         equ 0005h
CM2CON_CPOL_POSITION                     equ 0005h
CM2CON_CPOL_SIZE                         equ 0001h
CM2CON_CPOL_LENGTH                       equ 0001h
CM2CON_CPOL_MASK                         equ 0020h
CM2CON_COE_POSN                          equ 0006h
CM2CON_COE_POSITION                      equ 0006h
CM2CON_COE_SIZE                          equ 0001h
CM2CON_COE_LENGTH                        equ 0001h
CM2CON_COE_MASK                          equ 0040h
CM2CON_CON_POSN                          equ 0007h
CM2CON_CON_POSITION                      equ 0007h
CM2CON_CON_SIZE                          equ 0001h
CM2CON_CON_LENGTH                        equ 0001h
CM2CON_CON_MASK                          equ 0080h
CM2CON_CCH0_POSN                         equ 0000h
CM2CON_CCH0_POSITION                     equ 0000h
CM2CON_CCH0_SIZE                         equ 0001h
CM2CON_CCH0_LENGTH                       equ 0001h
CM2CON_CCH0_MASK                         equ 0001h
CM2CON_CCH1_POSN                         equ 0001h
CM2CON_CCH1_POSITION                     equ 0001h
CM2CON_CCH1_SIZE                         equ 0001h
CM2CON_CCH1_LENGTH                       equ 0001h
CM2CON_CCH1_MASK                         equ 0002h
CM2CON_EVPOL0_POSN                       equ 0003h
CM2CON_EVPOL0_POSITION                   equ 0003h
CM2CON_EVPOL0_SIZE                       equ 0001h
CM2CON_EVPOL0_LENGTH                     equ 0001h
CM2CON_EVPOL0_MASK                       equ 0008h
CM2CON_EVPOL1_POSN                       equ 0004h
CM2CON_EVPOL1_POSITION                   equ 0004h
CM2CON_EVPOL1_SIZE                       equ 0001h
CM2CON_EVPOL1_LENGTH                     equ 0001h
CM2CON_EVPOL1_MASK                       equ 0010h
CM2CON_CCH02_POSN                        equ 0000h
CM2CON_CCH02_POSITION                    equ 0000h
CM2CON_CCH02_SIZE                        equ 0001h
CM2CON_CCH02_LENGTH                      equ 0001h
CM2CON_CCH02_MASK                        equ 0001h
CM2CON_CCH12_POSN                        equ 0001h
CM2CON_CCH12_POSITION                    equ 0001h
CM2CON_CCH12_SIZE                        equ 0001h
CM2CON_CCH12_LENGTH                      equ 0001h
CM2CON_CCH12_MASK                        equ 0002h
CM2CON_CREF2_POSN                        equ 0002h
CM2CON_CREF2_POSITION                    equ 0002h
CM2CON_CREF2_SIZE                        equ 0001h
CM2CON_CREF2_LENGTH                      equ 0001h
CM2CON_CREF2_MASK                        equ 0004h
CM2CON_EVPOL02_POSN                      equ 0003h
CM2CON_EVPOL02_POSITION                  equ 0003h
CM2CON_EVPOL02_SIZE                      equ 0001h
CM2CON_EVPOL02_LENGTH                    equ 0001h
CM2CON_EVPOL02_MASK                      equ 0008h
CM2CON_EVPOL12_POSN                      equ 0004h
CM2CON_EVPOL12_POSITION                  equ 0004h
CM2CON_EVPOL12_SIZE                      equ 0001h
CM2CON_EVPOL12_LENGTH                    equ 0001h
CM2CON_EVPOL12_MASK                      equ 0010h
CM2CON_CPOL2_POSN                        equ 0005h
CM2CON_CPOL2_POSITION                    equ 0005h
CM2CON_CPOL2_SIZE                        equ 0001h
CM2CON_CPOL2_LENGTH                      equ 0001h
CM2CON_CPOL2_MASK                        equ 0020h
CM2CON_COE2_POSN                         equ 0006h
CM2CON_COE2_POSITION                     equ 0006h
CM2CON_COE2_SIZE                         equ 0001h
CM2CON_COE2_LENGTH                       equ 0001h
CM2CON_COE2_MASK                         equ 0040h
CM2CON_CON2_POSN                         equ 0007h
CM2CON_CON2_POSITION                     equ 0007h
CM2CON_CON2_SIZE                         equ 0001h
CM2CON_CON2_LENGTH                       equ 0001h
CM2CON_CON2_MASK                         equ 0080h

// Register: SSP2CON3
#define SSP2CON3 SSP2CON3
SSP2CON3                                 equ 0F39h
// bitfield definitions
SSP2CON3_DHEN_POSN                       equ 0000h
SSP2CON3_DHEN_POSITION                   equ 0000h
SSP2CON3_DHEN_SIZE                       equ 0001h
SSP2CON3_DHEN_LENGTH                     equ 0001h
SSP2CON3_DHEN_MASK                       equ 0001h
SSP2CON3_AHEN_POSN                       equ 0001h
SSP2CON3_AHEN_POSITION                   equ 0001h
SSP2CON3_AHEN_SIZE                       equ 0001h
SSP2CON3_AHEN_LENGTH                     equ 0001h
SSP2CON3_AHEN_MASK                       equ 0002h
SSP2CON3_SBCDE_POSN                      equ 0002h
SSP2CON3_SBCDE_POSITION                  equ 0002h
SSP2CON3_SBCDE_SIZE                      equ 0001h
SSP2CON3_SBCDE_LENGTH                    equ 0001h
SSP2CON3_SBCDE_MASK                      equ 0004h
SSP2CON3_SDAHT_POSN                      equ 0003h
SSP2CON3_SDAHT_POSITION                  equ 0003h
SSP2CON3_SDAHT_SIZE                      equ 0001h
SSP2CON3_SDAHT_LENGTH                    equ 0001h
SSP2CON3_SDAHT_MASK                      equ 0008h
SSP2CON3_BOEN_POSN                       equ 0004h
SSP2CON3_BOEN_POSITION                   equ 0004h
SSP2CON3_BOEN_SIZE                       equ 0001h
SSP2CON3_BOEN_LENGTH                     equ 0001h
SSP2CON3_BOEN_MASK                       equ 0010h
SSP2CON3_SCIE_POSN                       equ 0005h
SSP2CON3_SCIE_POSITION                   equ 0005h
SSP2CON3_SCIE_SIZE                       equ 0001h
SSP2CON3_SCIE_LENGTH                     equ 0001h
SSP2CON3_SCIE_MASK                       equ 0020h
SSP2CON3_PCIE_POSN                       equ 0006h
SSP2CON3_PCIE_POSITION                   equ 0006h
SSP2CON3_PCIE_SIZE                       equ 0001h
SSP2CON3_PCIE_LENGTH                     equ 0001h
SSP2CON3_PCIE_MASK                       equ 0040h
SSP2CON3_ACKTIM_POSN                     equ 0007h
SSP2CON3_ACKTIM_POSITION                 equ 0007h
SSP2CON3_ACKTIM_SIZE                     equ 0001h
SSP2CON3_ACKTIM_LENGTH                   equ 0001h
SSP2CON3_ACKTIM_MASK                     equ 0080h

// Register: T8CON
#define T8CON T8CON
T8CON                                    equ 0F3Ah
// bitfield definitions
T8CON_T8CKPS_POSN                        equ 0000h
T8CON_T8CKPS_POSITION                    equ 0000h
T8CON_T8CKPS_SIZE                        equ 0002h
T8CON_T8CKPS_LENGTH                      equ 0002h
T8CON_T8CKPS_MASK                        equ 0003h
T8CON_TMR8ON_POSN                        equ 0002h
T8CON_TMR8ON_POSITION                    equ 0002h
T8CON_TMR8ON_SIZE                        equ 0001h
T8CON_TMR8ON_LENGTH                      equ 0001h
T8CON_TMR8ON_MASK                        equ 0004h
T8CON_T8OUTPS_POSN                       equ 0003h
T8CON_T8OUTPS_POSITION                   equ 0003h
T8CON_T8OUTPS_SIZE                       equ 0004h
T8CON_T8OUTPS_LENGTH                     equ 0004h
T8CON_T8OUTPS_MASK                       equ 0078h
T8CON_T8CKPS0_POSN                       equ 0000h
T8CON_T8CKPS0_POSITION                   equ 0000h
T8CON_T8CKPS0_SIZE                       equ 0001h
T8CON_T8CKPS0_LENGTH                     equ 0001h
T8CON_T8CKPS0_MASK                       equ 0001h
T8CON_T8CKPS1_POSN                       equ 0001h
T8CON_T8CKPS1_POSITION                   equ 0001h
T8CON_T8CKPS1_SIZE                       equ 0001h
T8CON_T8CKPS1_LENGTH                     equ 0001h
T8CON_T8CKPS1_MASK                       equ 0002h
T8CON_T8OUTPS0_POSN                      equ 0003h
T8CON_T8OUTPS0_POSITION                  equ 0003h
T8CON_T8OUTPS0_SIZE                      equ 0001h
T8CON_T8OUTPS0_LENGTH                    equ 0001h
T8CON_T8OUTPS0_MASK                      equ 0008h
T8CON_T8OUTPS1_POSN                      equ 0004h
T8CON_T8OUTPS1_POSITION                  equ 0004h
T8CON_T8OUTPS1_SIZE                      equ 0001h
T8CON_T8OUTPS1_LENGTH                    equ 0001h
T8CON_T8OUTPS1_MASK                      equ 0010h
T8CON_T8OUTPS2_POSN                      equ 0005h
T8CON_T8OUTPS2_POSITION                  equ 0005h
T8CON_T8OUTPS2_SIZE                      equ 0001h
T8CON_T8OUTPS2_LENGTH                    equ 0001h
T8CON_T8OUTPS2_MASK                      equ 0020h
T8CON_T8OUTPS3_POSN                      equ 0006h
T8CON_T8OUTPS3_POSITION                  equ 0006h
T8CON_T8OUTPS3_SIZE                      equ 0001h
T8CON_T8OUTPS3_LENGTH                    equ 0001h
T8CON_T8OUTPS3_MASK                      equ 0040h

// Register: PR8
#define PR8 PR8
PR8                                      equ 0F3Bh
// bitfield definitions
PR8_PR8_POSN                             equ 0000h
PR8_PR8_POSITION                         equ 0000h
PR8_PR8_SIZE                             equ 0008h
PR8_PR8_LENGTH                           equ 0008h
PR8_PR8_MASK                             equ 00FFh

// Register: TMR8
#define TMR8 TMR8
TMR8                                     equ 0F3Ch
// bitfield definitions
TMR8_TMR8_POSN                           equ 0000h
TMR8_TMR8_POSITION                       equ 0000h
TMR8_TMR8_SIZE                           equ 0008h
TMR8_TMR8_LENGTH                         equ 0008h
TMR8_TMR8_MASK                           equ 00FFh

// Register: T6CON
#define T6CON T6CON
T6CON                                    equ 0F3Dh
// bitfield definitions
T6CON_T6CKPS_POSN                        equ 0000h
T6CON_T6CKPS_POSITION                    equ 0000h
T6CON_T6CKPS_SIZE                        equ 0002h
T6CON_T6CKPS_LENGTH                      equ 0002h
T6CON_T6CKPS_MASK                        equ 0003h
T6CON_TMR6ON_POSN                        equ 0002h
T6CON_TMR6ON_POSITION                    equ 0002h
T6CON_TMR6ON_SIZE                        equ 0001h
T6CON_TMR6ON_LENGTH                      equ 0001h
T6CON_TMR6ON_MASK                        equ 0004h
T6CON_T6OUTPS_POSN                       equ 0003h
T6CON_T6OUTPS_POSITION                   equ 0003h
T6CON_T6OUTPS_SIZE                       equ 0004h
T6CON_T6OUTPS_LENGTH                     equ 0004h
T6CON_T6OUTPS_MASK                       equ 0078h
T6CON_T6CKPS0_POSN                       equ 0000h
T6CON_T6CKPS0_POSITION                   equ 0000h
T6CON_T6CKPS0_SIZE                       equ 0001h
T6CON_T6CKPS0_LENGTH                     equ 0001h
T6CON_T6CKPS0_MASK                       equ 0001h
T6CON_T6CKPS1_POSN                       equ 0001h
T6CON_T6CKPS1_POSITION                   equ 0001h
T6CON_T6CKPS1_SIZE                       equ 0001h
T6CON_T6CKPS1_LENGTH                     equ 0001h
T6CON_T6CKPS1_MASK                       equ 0002h
T6CON_T6OUTPS0_POSN                      equ 0003h
T6CON_T6OUTPS0_POSITION                  equ 0003h
T6CON_T6OUTPS0_SIZE                      equ 0001h
T6CON_T6OUTPS0_LENGTH                    equ 0001h
T6CON_T6OUTPS0_MASK                      equ 0008h
T6CON_T6OUTPS1_POSN                      equ 0004h
T6CON_T6OUTPS1_POSITION                  equ 0004h
T6CON_T6OUTPS1_SIZE                      equ 0001h
T6CON_T6OUTPS1_LENGTH                    equ 0001h
T6CON_T6OUTPS1_MASK                      equ 0010h
T6CON_T6OUTPS2_POSN                      equ 0005h
T6CON_T6OUTPS2_POSITION                  equ 0005h
T6CON_T6OUTPS2_SIZE                      equ 0001h
T6CON_T6OUTPS2_LENGTH                    equ 0001h
T6CON_T6OUTPS2_MASK                      equ 0020h
T6CON_T6OUTPS3_POSN                      equ 0006h
T6CON_T6OUTPS3_POSITION                  equ 0006h
T6CON_T6OUTPS3_SIZE                      equ 0001h
T6CON_T6OUTPS3_LENGTH                    equ 0001h
T6CON_T6OUTPS3_MASK                      equ 0040h

// Register: PR6
#define PR6 PR6
PR6                                      equ 0F3Eh
// bitfield definitions
PR6_PR6_POSN                             equ 0000h
PR6_PR6_POSITION                         equ 0000h
PR6_PR6_SIZE                             equ 0008h
PR6_PR6_LENGTH                           equ 0008h
PR6_PR6_MASK                             equ 00FFh

// Register: TMR6
#define TMR6 TMR6
TMR6                                     equ 0F3Fh
// bitfield definitions
TMR6_TMR6_POSN                           equ 0000h
TMR6_TMR6_POSITION                       equ 0000h
TMR6_TMR6_SIZE                           equ 0008h
TMR6_TMR6_LENGTH                         equ 0008h
TMR6_TMR6_MASK                           equ 00FFh

// Register: CCP10CON
#define CCP10CON CCP10CON
CCP10CON                                 equ 0F40h
// bitfield definitions
CCP10CON_CCP10M_POSN                     equ 0000h
CCP10CON_CCP10M_POSITION                 equ 0000h
CCP10CON_CCP10M_SIZE                     equ 0004h
CCP10CON_CCP10M_LENGTH                   equ 0004h
CCP10CON_CCP10M_MASK                     equ 000Fh
CCP10CON_DC10B_POSN                      equ 0004h
CCP10CON_DC10B_POSITION                  equ 0004h
CCP10CON_DC10B_SIZE                      equ 0002h
CCP10CON_DC10B_LENGTH                    equ 0002h
CCP10CON_DC10B_MASK                      equ 0030h
CCP10CON_CCP10M0_POSN                    equ 0000h
CCP10CON_CCP10M0_POSITION                equ 0000h
CCP10CON_CCP10M0_SIZE                    equ 0001h
CCP10CON_CCP10M0_LENGTH                  equ 0001h
CCP10CON_CCP10M0_MASK                    equ 0001h
CCP10CON_CCP10M1_POSN                    equ 0001h
CCP10CON_CCP10M1_POSITION                equ 0001h
CCP10CON_CCP10M1_SIZE                    equ 0001h
CCP10CON_CCP10M1_LENGTH                  equ 0001h
CCP10CON_CCP10M1_MASK                    equ 0002h
CCP10CON_CCP10M2_POSN                    equ 0002h
CCP10CON_CCP10M2_POSITION                equ 0002h
CCP10CON_CCP10M2_SIZE                    equ 0001h
CCP10CON_CCP10M2_LENGTH                  equ 0001h
CCP10CON_CCP10M2_MASK                    equ 0004h
CCP10CON_CCP10M3_POSN                    equ 0003h
CCP10CON_CCP10M3_POSITION                equ 0003h
CCP10CON_CCP10M3_SIZE                    equ 0001h
CCP10CON_CCP10M3_LENGTH                  equ 0001h
CCP10CON_CCP10M3_MASK                    equ 0008h
CCP10CON_DC10B0_POSN                     equ 0004h
CCP10CON_DC10B0_POSITION                 equ 0004h
CCP10CON_DC10B0_SIZE                     equ 0001h
CCP10CON_DC10B0_LENGTH                   equ 0001h
CCP10CON_DC10B0_MASK                     equ 0010h
CCP10CON_DC10B1_POSN                     equ 0005h
CCP10CON_DC10B1_POSITION                 equ 0005h
CCP10CON_DC10B1_SIZE                     equ 0001h
CCP10CON_DC10B1_LENGTH                   equ 0001h
CCP10CON_DC10B1_MASK                     equ 0020h
CCP10CON_CCP10Y_POSN                     equ 0004h
CCP10CON_CCP10Y_POSITION                 equ 0004h
CCP10CON_CCP10Y_SIZE                     equ 0001h
CCP10CON_CCP10Y_LENGTH                   equ 0001h
CCP10CON_CCP10Y_MASK                     equ 0010h
CCP10CON_CCP10X_POSN                     equ 0005h
CCP10CON_CCP10X_POSITION                 equ 0005h
CCP10CON_CCP10X_SIZE                     equ 0001h
CCP10CON_CCP10X_LENGTH                   equ 0001h
CCP10CON_CCP10X_MASK                     equ 0020h

// Register: CCPR10
#define CCPR10 CCPR10
CCPR10                                   equ 0F41h

// Register: CCPR10L
#define CCPR10L CCPR10L
CCPR10L                                  equ 0F41h
// bitfield definitions
CCPR10L_CCPR10L_POSN                     equ 0000h
CCPR10L_CCPR10L_POSITION                 equ 0000h
CCPR10L_CCPR10L_SIZE                     equ 0008h
CCPR10L_CCPR10L_LENGTH                   equ 0008h
CCPR10L_CCPR10L_MASK                     equ 00FFh

