GopalSaraf/Practicals/PSDL/include/proc/pic18f95j94.inc
// Register: TXBUF
#define TXBUF TXBUF
TXBUF                                    equ 0F6Ah
// bitfield definitions
TXBUF_TXBUF_POSN                         equ 0000h
TXBUF_TXBUF_POSITION                     equ 0000h
TXBUF_TXBUF_SIZE                         equ 0008h
TXBUF_TXBUF_LENGTH                       equ 0008h
TXBUF_TXBUF_MASK                         equ 00FFh
TXBUF_TXBUF0_POSN                        equ 0000h
TXBUF_TXBUF0_POSITION                    equ 0000h
TXBUF_TXBUF0_SIZE                        equ 0001h
TXBUF_TXBUF0_LENGTH                      equ 0001h
TXBUF_TXBUF0_MASK                        equ 0001h
TXBUF_TXBUF1_POSN                        equ 0001h
TXBUF_TXBUF1_POSITION                    equ 0001h
TXBUF_TXBUF1_SIZE                        equ 0001h
TXBUF_TXBUF1_LENGTH                      equ 0001h
TXBUF_TXBUF1_MASK                        equ 0002h
TXBUF_TXBUF2_POSN                        equ 0002h
TXBUF_TXBUF2_POSITION                    equ 0002h
TXBUF_TXBUF2_SIZE                        equ 0001h
TXBUF_TXBUF2_LENGTH                      equ 0001h
TXBUF_TXBUF2_MASK                        equ 0004h
TXBUF_TXBUF3_POSN                        equ 0003h
TXBUF_TXBUF3_POSITION                    equ 0003h
TXBUF_TXBUF3_SIZE                        equ 0001h
TXBUF_TXBUF3_LENGTH                      equ 0001h
TXBUF_TXBUF3_MASK                        equ 0008h
TXBUF_TXBUF4_POSN                        equ 0004h
TXBUF_TXBUF4_POSITION                    equ 0004h
TXBUF_TXBUF4_SIZE                        equ 0001h
TXBUF_TXBUF4_LENGTH                      equ 0001h
TXBUF_TXBUF4_MASK                        equ 0010h
TXBUF_TXBUF5_POSN                        equ 0005h
TXBUF_TXBUF5_POSITION                    equ 0005h
TXBUF_TXBUF5_SIZE                        equ 0001h
TXBUF_TXBUF5_LENGTH                      equ 0001h
TXBUF_TXBUF5_MASK                        equ 0020h
TXBUF_TXBUF6_POSN                        equ 0006h
TXBUF_TXBUF6_POSITION                    equ 0006h
TXBUF_TXBUF6_SIZE                        equ 0001h
TXBUF_TXBUF6_LENGTH                      equ 0001h
TXBUF_TXBUF6_MASK                        equ 0040h
TXBUF_TXBUF7_POSN                        equ 0007h
TXBUF_TXBUF7_POSITION                    equ 0007h
TXBUF_TXBUF7_SIZE                        equ 0001h
TXBUF_TXBUF7_LENGTH                      equ 0001h
TXBUF_TXBUF7_MASK                        equ 0080h

// Register: DMABCH
#define DMABCH DMABCH
DMABCH                                   equ 0F6Bh
// bitfield definitions
DMABCH_DMACNTHB_POSN                     equ 0000h
DMABCH_DMACNTHB_POSITION                 equ 0000h
DMABCH_DMACNTHB_SIZE                     equ 0002h
DMABCH_DMACNTHB_LENGTH                   equ 0002h
DMABCH_DMACNTHB_MASK                     equ 0003h
DMABCH_BC8_POSN                          equ 0000h
DMABCH_BC8_POSITION                      equ 0000h
DMABCH_BC8_SIZE                          equ 0001h
DMABCH_BC8_LENGTH                        equ 0001h
DMABCH_BC8_MASK                          equ 0001h
DMABCH_BC9_POSN                          equ 0001h
DMABCH_BC9_POSITION                      equ 0001h
DMABCH_BC9_SIZE                          equ 0001h
DMABCH_BC9_LENGTH                        equ 0001h
DMABCH_BC9_MASK                          equ 0002h

// Register: DMABCL
#define DMABCL DMABCL
DMABCL                                   equ 0F6Ch
// bitfield definitions
DMABCL_DMACNTLB_POSN                     equ 0000h
DMABCL_DMACNTLB_POSITION                 equ 0000h
DMABCL_DMACNTLB_SIZE                     equ 0008h
DMABCL_DMACNTLB_LENGTH                   equ 0008h
DMABCL_DMACNTLB_MASK                     equ 00FFh
DMABCL_BC0_POSN                          equ 0000h
DMABCL_BC0_POSITION                      equ 0000h
DMABCL_BC0_SIZE                          equ 0001h
DMABCL_BC0_LENGTH                        equ 0001h
DMABCL_BC0_MASK                          equ 0001h
DMABCL_BC1_POSN                          equ 0001h
DMABCL_BC1_POSITION                      equ 0001h
DMABCL_BC1_SIZE                          equ 0001h
DMABCL_BC1_LENGTH                        equ 0001h
DMABCL_BC1_MASK                          equ 0002h
DMABCL_BC2_POSN                          equ 0002h
DMABCL_BC2_POSITION                      equ 0002h
DMABCL_BC2_SIZE                          equ 0001h
DMABCL_BC2_LENGTH                        equ 0001h
DMABCL_BC2_MASK                          equ 0004h
DMABCL_BC3_POSN                          equ 0003h
DMABCL_BC3_POSITION                      equ 0003h
DMABCL_BC3_SIZE                          equ 0001h
DMABCL_BC3_LENGTH                        equ 0001h
DMABCL_BC3_MASK                          equ 0008h
DMABCL_BC4_POSN                          equ 0004h
DMABCL_BC4_POSITION                      equ 0004h
DMABCL_BC4_SIZE                          equ 0001h
DMABCL_BC4_LENGTH                        equ 0001h
DMABCL_BC4_MASK                          equ 0010h
DMABCL_BC5_POSN                          equ 0005h
DMABCL_BC5_POSITION                      equ 0005h
DMABCL_BC5_SIZE                          equ 0001h
DMABCL_BC5_LENGTH                        equ 0001h
DMABCL_BC5_MASK                          equ 0020h
DMABCL_BC6_POSN                          equ 0006h
DMABCL_BC6_POSITION                      equ 0006h
DMABCL_BC6_SIZE                          equ 0001h
DMABCL_BC6_LENGTH                        equ 0001h
DMABCL_BC6_MASK                          equ 0040h
DMABCL_BC7_POSN                          equ 0007h
DMABCL_BC7_POSITION                      equ 0007h
DMABCL_BC7_SIZE                          equ 0001h
DMABCL_BC7_LENGTH                        equ 0001h
DMABCL_BC7_MASK                          equ 0080h

// Register: RXADDRH
#define RXADDRH RXADDRH
RXADDRH                                  equ 0F6Dh
// bitfield definitions
RXADDRH_DMARCVPTRHB_POSN                 equ 0000h
RXADDRH_DMARCVPTRHB_POSITION             equ 0000h
RXADDRH_DMARCVPTRHB_SIZE                 equ 0004h
RXADDRH_DMARCVPTRHB_LENGTH               equ 0004h
RXADDRH_DMARCVPTRHB_MASK                 equ 000Fh
RXADDRH_RXADDR8_POSN                     equ 0000h
RXADDRH_RXADDR8_POSITION                 equ 0000h
RXADDRH_RXADDR8_SIZE                     equ 0001h
RXADDRH_RXADDR8_LENGTH                   equ 0001h
RXADDRH_RXADDR8_MASK                     equ 0001h
RXADDRH_RXADDR9_POSN                     equ 0001h
RXADDRH_RXADDR9_POSITION                 equ 0001h
RXADDRH_RXADDR9_SIZE                     equ 0001h
RXADDRH_RXADDR9_LENGTH                   equ 0001h
RXADDRH_RXADDR9_MASK                     equ 0002h
RXADDRH_RXADDR10_POSN                    equ 0002h
RXADDRH_RXADDR10_POSITION                equ 0002h
RXADDRH_RXADDR10_SIZE                    equ 0001h
RXADDRH_RXADDR10_LENGTH                  equ 0001h
RXADDRH_RXADDR10_MASK                    equ 0004h
RXADDRH_RXADDR11_POSN                    equ 0003h
RXADDRH_RXADDR11_POSITION                equ 0003h
RXADDRH_RXADDR11_SIZE                    equ 0001h
RXADDRH_RXADDR11_LENGTH                  equ 0001h
RXADDRH_RXADDR11_MASK                    equ 0008h

