GopalSaraf/Practicals/PSDL/include/proc/pic18f95j94.inc
#define CCP8R0                           BANKMASK(RPINR36_37), 0, b
#define CCP8R1                           BANKMASK(RPINR36_37), 1, b
#define CCP8R2                           BANKMASK(RPINR36_37), 2, b
#define CCP8R3                           BANKMASK(RPINR36_37), 3, b
#define CCP8X                            BANKMASK(CCP8CON), 5, b
#define CCP8Y                            BANKMASK(CCP8CON), 4, b
#define CCP9                             BANKMASK(PORTH), 4, a
#define CCP9E                            BANKMASK(PORTE), 3, a
#define CCP9IE                           BANKMASK(PIE4), 6, a
#define CCP9IF                           BANKMASK(PIR4), 6, a
#define CCP9IP                           BANKMASK(IPR4), 6, a
#define CCP9M0                           BANKMASK(CCP9CON), 0, b
#define CCP9M1                           BANKMASK(CCP9CON), 1, b
#define CCP9M2                           BANKMASK(CCP9CON), 2, b
#define CCP9M3                           BANKMASK(CCP9CON), 3, b
#define CCP9MD                           BANKMASK(PMD0), 6, b
#define CCP9OD                           BANKMASK(ODCON2), 6, b
#define CCP9R0                           BANKMASK(RPINR36_37), 4, b
#define CCP9R1                           BANKMASK(RPINR36_37), 5, b
#define CCP9R2                           BANKMASK(RPINR36_37), 6, b
#define CCP9R3                           BANKMASK(RPINR36_37), 7, b
#define CCP9X                            BANKMASK(CCP9CON), 5, b
#define CCP9Y                            BANKMASK(CCP9CON), 4, b
#define CF                               BANKMASK(OSCCON2), 3, a
#define CH0NA0                           BANKMASK(ADCHS0L), 5, b
#define CH0NA1                           BANKMASK(ADCHS0L), 6, b
#define CH0NA2                           BANKMASK(ADCHS0L), 7, b
#define CH0NB0                           BANKMASK(ADCHS0H), 5, b
#define CH0NB1                           BANKMASK(ADCHS0H), 6, b
#define CH0NB2                           BANKMASK(ADCHS0H), 7, b
#define CH0SA0                           BANKMASK(ADCHS0L), 0, b
#define CH0SA1                           BANKMASK(ADCHS0L), 1, b
#define CH0SA2                           BANKMASK(ADCHS0L), 2, b
#define CH0SA3                           BANKMASK(ADCHS0L), 3, b
#define CH0SA4                           BANKMASK(ADCHS0L), 4, b
#define CH0SB0                           BANKMASK(ADCHS0H), 0, b
#define CH0SB1                           BANKMASK(ADCHS0H), 1, b
#define CH0SB2                           BANKMASK(ADCHS0H), 2, b
#define CH0SB3                           BANKMASK(ADCHS0H), 3, b
#define CH0SB4                           BANKMASK(ADCHS0H), 4, b
#define CHH0                             BANKMASK(ADCHIT0L), 0, b
#define CHH1                             BANKMASK(ADCHIT0L), 1, b
#define CHH10                            BANKMASK(ADCHIT0H), 2, b
#define CHH11                            BANKMASK(ADCHIT0H), 3, b
#define CHH12                            BANKMASK(ADCHIT0H), 4, b
#define CHH13                            BANKMASK(ADCHIT0H), 5, b
#define CHH14                            BANKMASK(ADCHIT0H), 6, b
#define CHH15                            BANKMASK(ADCHIT0H), 7, b
#define CHH16                            BANKMASK(ADCHIT1L), 0, b
#define CHH17                            BANKMASK(ADCHIT1L), 1, b
#define CHH18                            BANKMASK(ADCHIT1L), 2, b
#define CHH19                            BANKMASK(ADCHIT1L), 3, b
#define CHH2                             BANKMASK(ADCHIT0L), 2, b
#define CHH20                            BANKMASK(ADCHIT1L), 4, b
#define CHH21                            BANKMASK(ADCHIT1L), 5, b
#define CHH22                            BANKMASK(ADCHIT1L), 6, b
#define CHH23                            BANKMASK(ADCHIT1L), 7, b
#define CHH24                            BANKMASK(ADCHIT1H), 0, b
#define CHH25                            BANKMASK(ADCHIT1H), 1, b
#define CHH26                            BANKMASK(ADCHIT1H), 2, b
#define CHH27                            BANKMASK(ADCHIT1H), 3, b
#define CHH28                            BANKMASK(ADCHIT1H), 4, b
#define CHH29                            BANKMASK(ADCHIT1H), 5, b
#define CHH3                             BANKMASK(ADCHIT0L), 3, b
#define CHH30                            BANKMASK(ADCHIT1H), 6, b
#define CHH4                             BANKMASK(ADCHIT0L), 4, b
#define CHH5                             BANKMASK(ADCHIT0L), 5, b
#define CHH6                             BANKMASK(ADCHIT0L), 6, b
#define CHH7                             BANKMASK(ADCHIT0L), 7, b
#define CHH8                             BANKMASK(ADCHIT0H), 0, b
#define CHH9                             BANKMASK(ADCHIT0H), 1, b
#define CHIME                            BANKMASK(ALRMCFG), 6, b
#define CKE1                             BANKMASK(SSP1STAT), 6, a
#define CKE2                             BANKMASK(SSP2STAT), 6, b
#define CKP1                             BANKMASK(SSP1CON1), 4, a
#define CKP2                             BANKMASK(SSP2CON1), 4, b
#define CKTXP                            BANKMASK(BAUDCON1), 4, a
#define CLKLOCK                          BANKMASK(OSCCON2), 7, a
#define CLKSEL0                          BANKMASK(LCDREG), 0, b
#define CLKSEL1                          BANKMASK(LCDREG), 1, b
#define CM                               BANKMASK(RCON), 5, a
#define CM0                              BANKMASK(ADCON5L), 0, b
#define CM1                              BANKMASK(ADCON5L), 1, b
#define CMIE                             BANKMASK(PIE2), 6, a
#define CMIF                             BANKMASK(PIR2), 6, a
#define CMIP                             BANKMASK(IPR2), 6, a
#define CMP1IE                           BANKMASK(PIE6), 0, a
#define CMP1IF                           BANKMASK(PIR6), 0, a
#define CMP1IP                           BANKMASK(IPR6), 0, a
#define CMP1MD                           BANKMASK(PMD4), 7, b
#define CMP2IE                           BANKMASK(PIE6), 1, a
#define CMP2IF                           BANKMASK(PIR6), 1, a
#define CMP2IP                           BANKMASK(IPR6), 1, a
#define CMP2MD                           BANKMASK(PMD4), 6, b
#define CMP3IE                           BANKMASK(PIE6), 2, a
#define CMP3IF                           BANKMASK(PIR6), 2, a
#define CMP3IP                           BANKMASK(IPR6), 2, a
#define CMP3MD                           BANKMASK(PMD4), 5, b
#define CMPL01                           BANKMASK(PSTR1CON), 6, a
#define CMPL02                           BANKMASK(PSTR2CON), 6, b
#define CMPL03                           BANKMASK(PSTR3CON), 6, b
#define CMPL11                           BANKMASK(PSTR1CON), 7, a
#define CMPL12                           BANKMASK(PSTR2CON), 7, b
#define CMPL13                           BANKMASK(PSTR3CON), 7, b
#define COE1                             BANKMASK(CM1CON), 6, b
#define COE2                             BANKMASK(CM2CON), 6, b
#define COE3                             BANKMASK(CM3CON), 6, b
#define CON1                             BANKMASK(CM1CON), 7, b
#define CON2                             BANKMASK(CM2CON), 7, b
#define CON3                             BANKMASK(CM3CON), 7, b
#define COSC0                            BANKMASK(OSCCON), 4, a
#define COSC1                            BANKMASK(OSCCON), 5, a
#define COSC2                            BANKMASK(OSCCON), 6, a
#define CPDIV0                           BANKMASK(OSCCON4), 6, a
#define CPDIV1                           BANKMASK(OSCCON4), 7, a
#define CPEN                             BANKMASK(LCDREG), 7, b
#define CPOL1                            BANKMASK(CM1CON), 5, b
#define CPOL2                            BANKMASK(CM2CON), 5, b
#define CPOL3                            BANKMASK(CM3CON), 5, b
#define CRC16EE                          BANKMASK(UEIE), 2, b
#define CRC16EF                          BANKMASK(UEIR), 2, a
#define CRC5EE                           BANKMASK(UEIE), 1, b
#define CRC5EF                           BANKMASK(UEIR), 1, a
#define CREF1                            BANKMASK(CM1CON), 2, b
#define CREF2                            BANKMASK(CM2CON), 2, b
#define CREF3                            BANKMASK(CM3CON), 2, b
#define CS                               BANKMASK(PORTE), 2, a
#define CS0                              BANKMASK(LCDCON), 3, b
#define CS1                              BANKMASK(LCDCON), 4, b
#define CSCNA                            BANKMASK(ADCON2H), 2, b
#define CSRC1                            BANKMASK(TXSTA1), 7, a
#define CSS0                             BANKMASK(ADCSS0L), 0, b
#define CSS1                             BANKMASK(ADCSS0L), 1, b
#define CSS10                            BANKMASK(ADCSS0H), 2, b
#define CSS11                            BANKMASK(ADCSS0H), 3, b
#define CSS12                            BANKMASK(ADCSS0H), 4, b
#define CSS13                            BANKMASK(ADCSS0H), 5, b
#define CSS14                            BANKMASK(ADCSS0H), 6, b
#define CSS15                            BANKMASK(ADCSS0H), 7, b
#define CSS16                            BANKMASK(ADCSS1L), 0, b
#define CSS17                            BANKMASK(ADCSS1L), 1, b
#define CSS18                            BANKMASK(ADCSS1L), 2, b
#define CSS19                            BANKMASK(ADCSS1L), 3, b
#define CSS2                             BANKMASK(ADCSS0L), 2, b
#define CSS20                            BANKMASK(ADCSS1L), 4, b
#define CSS21                            BANKMASK(ADCSS1L), 5, b
#define CSS22                            BANKMASK(ADCSS1L), 6, b
#define CSS23                            BANKMASK(ADCSS1L), 7, b
#define CSS24                            BANKMASK(ADCSS1H), 0, b
#define CSS25                            BANKMASK(ADCSS1H), 1, b
#define CSS26                            BANKMASK(ADCSS1H), 2, b
#define CSS27                            BANKMASK(ADCSS1H), 3, b
#define CSS28                            BANKMASK(ADCSS1H), 4, b
#define CSS29                            BANKMASK(ADCSS1H), 5, b
#define CSS3                             BANKMASK(ADCSS0L), 3, b
#define CSS30                            BANKMASK(ADCSS1H), 6, b
#define CSS4                             BANKMASK(ADCSS0L), 4, b
#define CSS5                             BANKMASK(ADCSS0L), 5, b
#define CSS6                             BANKMASK(ADCSS0L), 6, b
#define CSS7                             BANKMASK(ADCSS0L), 7, b
#define CSS8                             BANKMASK(ADCSS0H), 0, b
#define CSS9                             BANKMASK(ADCSS0H), 1, b
#define CTMUEN                           BANKMASK(CTMUCON1), 7, b
#define CTMUEN0                          BANKMASK(ADCTMUEN0L), 0, b
#define CTMUEN1                          BANKMASK(ADCTMUEN0L), 1, b
#define CTMUEN10                         BANKMASK(ADCTMUEN0H), 2, b
#define CTMUEN11                         BANKMASK(ADCTMUEN0H), 3, b
#define CTMUEN12                         BANKMASK(ADCTMUEN0H), 4, b
#define CTMUEN13                         BANKMASK(ADCTMUEN0H), 5, b
#define CTMUEN14                         BANKMASK(ADCTMUEN0H), 6, b
#define CTMUEN15                         BANKMASK(ADCTMUEN0H), 7, b
#define CTMUEN2                          BANKMASK(ADCTMUEN0L), 2, b
#define CTMUEN20                         BANKMASK(ADCTMUEN1L), 4, b
#define CTMUEN21                         BANKMASK(ADCTMUEN1L), 5, b
#define CTMUEN22                         BANKMASK(ADCTMUEN1L), 6, b
#define CTMUEN23                         BANKMASK(ADCTMUEN1L), 7, b
#define CTMUEN3                          BANKMASK(ADCTMUEN0L), 3, b
#define CTMUEN30                         BANKMASK(ADCTMUEN1H), 6, b
#define CTMUEN4                          BANKMASK(ADCTMUEN0L), 4, b
#define CTMUEN5                          BANKMASK(ADCTMUEN0L), 5, b
#define CTMUEN6                          BANKMASK(ADCTMUEN0L), 6, b
#define CTMUEN7                          BANKMASK(ADCTMUEN0L), 7, b
#define CTMUEN8                          BANKMASK(ADCTMUEN0H), 0, b
#define CTMUEN9                          BANKMASK(ADCTMUEN0H), 1, b
#define CTMUIE                           BANKMASK(PIE3), 3, a
#define CTMUIF                           BANKMASK(PIR3), 3, a
#define CTMUIP                           BANKMASK(IPR3), 3, a
#define CTMUMD                           BANKMASK(PMD3), 6, b
#define CTMUREQ                          BANKMASK(ADCON5H), 5, b
#define CTMUSIDL                         BANKMASK(CTMUCON1), 5, b
#define CTTRIG                           BANKMASK(CTMUCON1), 0, b
#define CTUMEN16                         BANKMASK(ADCTMUEN1L), 0, b
#define CTUMEN17                         BANKMASK(ADCTMUEN1L), 1, b
#define CTUMEN18                         BANKMASK(ADCTMUEN1L), 2, b
#define CTUMEN19                         BANKMASK(ADCTMUEN1L), 3, b
#define CTUMEN24                         BANKMASK(ADCTMUEN1H), 0, b
#define CTUMEN25                         BANKMASK(ADCTMUEN1H), 1, b
#define CTUMEN26                         BANKMASK(ADCTMUEN1H), 2, b
#define CTUMEN27                         BANKMASK(ADCTMUEN1H), 3, b
#define CTUMEN28                         BANKMASK(ADCTMUEN1H), 4, b
#define CTUMEN29                         BANKMASK(ADCTMUEN1H), 5, b
#define CVR0                             BANKMASK(CVRCONH), 0, a
#define CVR1                             BANKMASK(CVRCONH), 1, a
#define CVR2                             BANKMASK(CVRCONH), 2, a
#define CVR3                             BANKMASK(CVRCONH), 3, a
#define CVR4                             BANKMASK(CVRCONH), 4, a
#define CVREN                            BANKMASK(CVRCONL), 7, a
#define CVRNSS                           BANKMASK(CVRCONL), 0, a
#define CVROE                            BANKMASK(CVRCONL), 6, a
#define CVRPSS0                          BANKMASK(CVRCONL), 4, a
#define CVRPSS1                          BANKMASK(CVRCONL), 5, a
#define DA1                              BANKMASK(SSP1STAT), 5, a
#define DA2                              BANKMASK(SSP2STAT), 5, b
#define DATA_ADDRESS1                    BANKMASK(SSP1STAT), 5, a
#define DATA_ADDRESS2                    BANKMASK(SSP2STAT), 5, b
#define DC                               BANKMASK(STATUS), 1, a
#define DC10B0                           BANKMASK(CCP10CON), 4, b
#define DC10B1                           BANKMASK(CCP10CON), 5, b
#define DC1B0                            BANKMASK(CCP1CON), 4, a
#define DC1B1                            BANKMASK(CCP1CON), 5, a
#define DC2B0                            BANKMASK(CCP2CON), 4, b
#define DC2B1                            BANKMASK(CCP2CON), 5, b
#define DC3B0                            BANKMASK(CCP3CON), 4, b
#define DC3B1                            BANKMASK(CCP3CON), 5, b
#define DC4B0                            BANKMASK(CCP4CON), 4, b
#define DC4B1                            BANKMASK(CCP4CON), 5, b
#define DC5B0                            BANKMASK(CCP5CON), 4, b
#define DC5B1                            BANKMASK(CCP5CON), 5, b
#define DC6B0                            BANKMASK(CCP6CON), 4, b
#define DC6B1                            BANKMASK(CCP6CON), 5, b
#define DC7B0                            BANKMASK(CCP7CON), 4, b
#define DC7B1                            BANKMASK(CCP7CON), 5, b
#define DC8B0                            BANKMASK(CCP8CON), 4, b
#define DC8B1                            BANKMASK(CCP8CON), 5, b
#define DC9B0                            BANKMASK(CCP9CON), 4, b
#define DC9B1                            BANKMASK(CCP9CON), 5, b
#define DFN8EE                           BANKMASK(UEIE), 3, b
#define DFN8EF                           BANKMASK(UEIR), 3, a
#define DIR                              BANKMASK(USTAT), 2, a
#define DLYCYC0                          BANKMASK(DMACON2), 4, b
#define DLYCYC1                          BANKMASK(DMACON2), 5, b
#define DLYCYC2                          BANKMASK(DMACON2), 6, b
#define DLYCYC3                          BANKMASK(DMACON2), 7, b
#define DLYINTEN                         BANKMASK(DMACON1), 1, a
#define DMAEN                            BANKMASK(DMACON1), 0, a
#define DONE                             BANKMASK(ADCON1L), 0, a
#define DPSLP                            BANKMASK(RCON4), 2, a
#define DSBOR                            BANKMASK(DSCONL), 1, b
#define DSEN                             BANKMASK(DSCONH), 7, b
#define DSFLT                            BANKMASK(DSWAKEL), 7, b
#define DSICD                            BANKMASK(DSWAKEL), 1, b
#define DSINT0                           BANKMASK(DSWAKEH), 0, b
#define DSMCLR                           BANKMASK(DSWAKEL), 2, b
#define DSPOR                            BANKMASK(DSWAKEL), 0, b
#define DSRTC                            BANKMASK(DSWAKEL), 3, b
#define DSULP                            BANKMASK(DSWAKEL), 5, b
#define DSWDT                            BANKMASK(DSWAKEL), 4, b
#define DTRXP                            BANKMASK(BAUDCON1), 5, a
#define DTRXP1                           BANKMASK(BAUDCON1), 5, a
#define DTRXP2                           BANKMASK(BAUDCON2), 5, b
#define DTRXP3                           BANKMASK(BAUDCON3), 5, b
#define DTRXP4                           BANKMASK(BAUDCON4), 5, b
#define DUPLEX0                          BANKMASK(DMACON1), 2, a
#define DUPLEX1                          BANKMASK(DMACON1), 3, a
#define D_A1                             BANKMASK(SSP1STAT), 5, a
#define D_A2                             BANKMASK(SSP2STAT), 5, b
#define D_NOT_A1                         BANKMASK(SSP1STAT), 5, a
#define D_NOT_A2                         BANKMASK(SSP2STAT), 5, b
#define D_nA1                            BANKMASK(SSP1STAT), 5, a
#define D_nA2                            BANKMASK(SSP2STAT), 5, b
#define EBDIS                            BANKMASK(MEMCON), 7, b
#define ECCP1AS0                         BANKMASK(ECCP1AS), 4, a
#define ECCP1AS1                         BANKMASK(ECCP1AS), 5, a
#define ECCP1AS2                         BANKMASK(ECCP1AS), 6, a
#define ECCP1ASE                         BANKMASK(ECCP1AS), 7, a
#define ECCP1MD                          BANKMASK(PMD1), 6, b
#define ECCP1OD                          BANKMASK(ODCON1), 6, b
#define ECCP1R0                          BANKMASK(RPINR14_15), 4, b
#define ECCP1R1                          BANKMASK(RPINR14_15), 5, b
#define ECCP1R2                          BANKMASK(RPINR14_15), 6, b
#define ECCP1R3                          BANKMASK(RPINR14_15), 7, b
#define ECCP2AS0                         BANKMASK(ECCP2AS), 4, b
#define ECCP2AS1                         BANKMASK(ECCP2AS), 5, b
#define ECCP2AS2                         BANKMASK(ECCP2AS), 6, b
#define ECCP2ASE                         BANKMASK(ECCP2AS), 7, b
#define ECCP2MD                          BANKMASK(PMD1), 7, b
#define ECCP2OD                          BANKMASK(ODCON1), 7, b
#define ECCP2R0                          BANKMASK(RPINR16_17), 0, b
#define ECCP2R1                          BANKMASK(RPINR16_17), 1, b
#define ECCP2R2                          BANKMASK(RPINR16_17), 2, b
#define ECCP2R3                          BANKMASK(RPINR16_17), 3, b
#define ECCP3AS0                         BANKMASK(ECCP3AS), 4, b
#define ECCP3AS1                         BANKMASK(ECCP3AS), 5, b
#define ECCP3AS2                         BANKMASK(ECCP3AS), 6, b
#define ECCP3ASE                         BANKMASK(ECCP3AS), 7, b
#define ECCP3IE                          BANKMASK(PIE4), 0, a
#define ECCP3IF                          BANKMASK(PIR4), 0, a
#define ECCP3IP                          BANKMASK(IPR4), 0, a
#define ECCP3MD                          BANKMASK(PMD0), 0, b
#define ECCP3OD                          BANKMASK(ODCON2), 0, b
#define ECCP3R0                          BANKMASK(RPINR16_17), 4, b
#define ECCP3R1                          BANKMASK(RPINR16_17), 5, b
#define ECCP3R2                          BANKMASK(RPINR16_17), 6, b
#define ECCP3R3                          BANKMASK(RPINR16_17), 7, b
#define EDG1EN                           BANKMASK(CTMUCON4), 7, b
#define EDG1POL                          BANKMASK(CTMUCON4), 6, b
#define EDG1SEL0                         BANKMASK(CTMUCON4), 2, b
#define EDG1SEL1                         BANKMASK(CTMUCON4), 3, b
#define EDG1SEL2                         BANKMASK(CTMUCON4), 4, b
#define EDG1SEL3                         BANKMASK(CTMUCON4), 5, b
#define EDG1STAT                         BANKMASK(CTMUCON4), 0, b
#define EDG2EN                           BANKMASK(CTMUCON3), 7, b
#define EDG2POL                          BANKMASK(CTMUCON3), 6, b
#define EDG2SEL0                         BANKMASK(CTMUCON3), 2, b
#define EDG2SEL1                         BANKMASK(CTMUCON3), 3, b
#define EDG2SEL2                         BANKMASK(CTMUCON3), 4, b
#define EDG2SEL3                         BANKMASK(CTMUCON3), 5, b
#define EDG2STAT                         BANKMASK(CTMUCON4), 1, b
#define EDGEN                            BANKMASK(CTMUCON1), 3, b
#define EDGSEQEN                         BANKMASK(CTMUCON1), 2, b
#define ENDP0                            BANKMASK(USTAT), 3, a
#define ENDP1                            BANKMASK(USTAT), 4, a
#define ENDP2                            BANKMASK(USTAT), 5, a
#define ENDP3                            BANKMASK(USTAT), 6, a
#define EP0CONDIS                        BANKMASK(UEP0), 3, b
#define EP0HSHK                          BANKMASK(UEP0), 4, b
#define EP0INEN                          BANKMASK(UEP0), 1, b
#define EP0OUTEN                         BANKMASK(UEP0), 2, b
#define EP0STALL                         BANKMASK(UEP0), 0, b
#define EP1CONDIS                        BANKMASK(UEP1), 3, b
#define EP1HSHK                          BANKMASK(UEP1), 4, b
#define EP1INEN                          BANKMASK(UEP1), 1, b
#define EP1OUTEN                         BANKMASK(UEP1), 2, b
#define EP1STALL                         BANKMASK(UEP1), 0, b
#define EP2CONDIS                        BANKMASK(UEP2), 3, b
#define EP2HSHK                          BANKMASK(UEP2), 4, b
#define EP2INEN                          BANKMASK(UEP2), 1, b
#define EP2OUTEN                         BANKMASK(UEP2), 2, b
#define EP2STALL                         BANKMASK(UEP2), 0, b
#define EP3CONDIS                        BANKMASK(UEP3), 3, b
#define EP3HSHK                          BANKMASK(UEP3), 4, b
#define EP3INEN                          BANKMASK(UEP3), 1, b
#define EP3OUTEN                         BANKMASK(UEP3), 2, b
#define EP3STALL                         BANKMASK(UEP3), 0, b
#define EP4CONDIS                        BANKMASK(UEP4), 3, b
#define EP4HSHK                          BANKMASK(UEP4), 4, b
#define EP4INEN                          BANKMASK(UEP4), 1, b
#define EP4OUTEN                         BANKMASK(UEP4), 2, b
#define EP4STALL                         BANKMASK(UEP4), 0, b
#define EP5CONDIS                        BANKMASK(UEP5), 3, b
#define EP5HSHK                          BANKMASK(UEP5), 4, b
#define EP5INEN                          BANKMASK(UEP5), 1, b
#define EP5OUTEN                         BANKMASK(UEP5), 2, b
#define EP5STALL                         BANKMASK(UEP5), 0, b
#define EP6CONDIS                        BANKMASK(UEP6), 3, b
#define EP6HSHK                          BANKMASK(UEP6), 4, b
#define EP6INEN                          BANKMASK(UEP6), 1, b
#define EP6OUTEN                         BANKMASK(UEP6), 2, b
#define EP6STALL                         BANKMASK(UEP6), 0, b
#define EP7CONDIS                        BANKMASK(UEP7), 3, b
#define EP7HSHK                          BANKMASK(UEP7), 4, b
#define EP7INEN                          BANKMASK(UEP7), 1, b
#define EP7OUTEN                         BANKMASK(UEP7), 2, b
#define EP7STALL                         BANKMASK(UEP7), 0, b
#define EPCONDIS0                        BANKMASK(UEP0), 3, b
#define EPCONDIS1                        BANKMASK(UEP1), 3, b
#define EPCONDIS10                       BANKMASK(UEP10), 3, b
#define EPCONDIS11                       BANKMASK(UEP11), 3, b
#define EPCONDIS12                       BANKMASK(UEP12), 3, b
#define EPCONDIS13                       BANKMASK(UEP13), 3, b
