GopalSaraf/Practicals/PSDL/include/proc/pic18f95j94.inc
#define S03C5                            BANKMASK(LCDDATA40), 3, b
#define S03C6                            BANKMASK(LCDDATA48), 3, b
#define S03C7                            BANKMASK(LCDDATA56), 3, b
#define S04C0                            BANKMASK(LCDDATA0), 4, b
#define S04C1                            BANKMASK(LCDDATA8), 4, b
#define S04C2                            BANKMASK(LCDDATA16), 4, b
#define S04C3                            BANKMASK(LCDDATA24), 4, b
#define S04C4                            BANKMASK(LCDDATA32), 4, b
#define S04C5                            BANKMASK(LCDDATA40), 4, b
#define S04C6                            BANKMASK(LCDDATA48), 4, b
#define S04C7                            BANKMASK(LCDDATA56), 4, b
#define S05C0                            BANKMASK(LCDDATA0), 5, b
#define S05C1                            BANKMASK(LCDDATA8), 5, b
#define S05C2                            BANKMASK(LCDDATA16), 5, b
#define S05C3                            BANKMASK(LCDDATA24), 5, b
#define S05C4                            BANKMASK(LCDDATA32), 5, b
#define S05C5                            BANKMASK(LCDDATA40), 5, b
#define S05C6                            BANKMASK(LCDDATA48), 5, b
#define S05C7                            BANKMASK(LCDDATA56), 5, b
#define S06C0                            BANKMASK(LCDDATA0), 6, b
#define S06C1                            BANKMASK(LCDDATA8), 6, b
#define S06C2                            BANKMASK(LCDDATA16), 6, b
#define S06C3                            BANKMASK(LCDDATA24), 6, b
#define S06C4                            BANKMASK(LCDDATA32), 6, b
#define S06C5                            BANKMASK(LCDDATA40), 6, b
#define S06C6                            BANKMASK(LCDDATA48), 6, b
#define S06C7                            BANKMASK(LCDDATA56), 6, b
#define S07C0                            BANKMASK(LCDDATA0), 7, b
#define S07C1                            BANKMASK(LCDDATA8), 7, b
#define S07C2                            BANKMASK(LCDDATA16), 7, b
#define S07C3                            BANKMASK(LCDDATA24), 7, b
#define S07C4                            BANKMASK(LCDDATA32), 7, b
#define S07C5                            BANKMASK(LCDDATA40), 7, b
#define S07C6                            BANKMASK(LCDDATA48), 7, b
#define S07C7                            BANKMASK(LCDDATA56), 7, b
#define S08C0                            BANKMASK(LCDDATA1), 0, b
#define S08C1                            BANKMASK(LCDDATA9), 0, b
#define S08C2                            BANKMASK(LCDDATA17), 0, b
#define S08C3                            BANKMASK(LCDDATA25), 0, b
#define S08C4                            BANKMASK(LCDDATA33), 0, b
#define S08C5                            BANKMASK(LCDDATA41), 0, b
#define S08C6                            BANKMASK(LCDDATA49), 0, b
#define S08C7                            BANKMASK(LCDDATA57), 0, b
#define S09C0                            BANKMASK(LCDDATA1), 1, b
#define S09C1                            BANKMASK(LCDDATA9), 1, b
#define S09C2                            BANKMASK(LCDDATA17), 1, b
#define S09C3                            BANKMASK(LCDDATA25), 1, b
#define S09C4                            BANKMASK(LCDDATA33), 1, b
#define S09C5                            BANKMASK(LCDDATA41), 1, b
#define S09C6                            BANKMASK(LCDDATA49), 1, b
#define S09C7                            BANKMASK(LCDDATA57), 1, b
#define S10C0                            BANKMASK(LCDDATA1), 2, b
#define S10C1                            BANKMASK(LCDDATA9), 2, b
#define S10C2                            BANKMASK(LCDDATA17), 2, b
#define S10C3                            BANKMASK(LCDDATA25), 2, b
#define S10C4                            BANKMASK(LCDDATA33), 2, b
#define S10C5                            BANKMASK(LCDDATA41), 2, b
#define S10C6                            BANKMASK(LCDDATA49), 2, b
#define S10C7                            BANKMASK(LCDDATA57), 2, b
#define S11C0                            BANKMASK(LCDDATA1), 3, b
#define S11C1                            BANKMASK(LCDDATA9), 3, b
#define S11C2                            BANKMASK(LCDDATA17), 3, b
#define S11C3                            BANKMASK(LCDDATA25), 3, b
#define S11C4                            BANKMASK(LCDDATA33), 3, b
#define S11C5                            BANKMASK(LCDDATA41), 3, b
#define S11C6                            BANKMASK(LCDDATA49), 3, b
#define S11C7                            BANKMASK(LCDDATA57), 3, b
#define S12C0                            BANKMASK(LCDDATA1), 4, b
#define S12C1                            BANKMASK(LCDDATA9), 4, b
#define S12C2                            BANKMASK(LCDDATA17), 4, b
#define S12C3                            BANKMASK(LCDDATA25), 4, b
#define S12C4                            BANKMASK(LCDDATA33), 4, b
#define S12C5                            BANKMASK(LCDDATA41), 4, b
#define S12C6                            BANKMASK(LCDDATA49), 4, b
#define S12C7                            BANKMASK(LCDDATA57), 4, b
#define S13C0                            BANKMASK(LCDDATA1), 5, b
#define S13C1                            BANKMASK(LCDDATA9), 5, b
#define S13C2                            BANKMASK(LCDDATA17), 5, b
#define S13C3                            BANKMASK(LCDDATA25), 5, b
#define S13C4                            BANKMASK(LCDDATA33), 5, b
#define S13C5                            BANKMASK(LCDDATA41), 5, b
#define S13C6                            BANKMASK(LCDDATA49), 5, b
#define S13C7                            BANKMASK(LCDDATA57), 5, b
#define S14C0                            BANKMASK(LCDDATA1), 6, b
#define S14C1                            BANKMASK(LCDDATA9), 6, b
#define S14C2                            BANKMASK(LCDDATA17), 6, b
#define S14C3                            BANKMASK(LCDDATA25), 6, b
#define S14C4                            BANKMASK(LCDDATA33), 6, b
#define S14C5                            BANKMASK(LCDDATA41), 6, b
#define S14C6                            BANKMASK(LCDDATA49), 6, b
#define S14C7                            BANKMASK(LCDDATA57), 6, b
#define S15C0                            BANKMASK(LCDDATA1), 7, b
#define S15C1                            BANKMASK(LCDDATA9), 7, b
#define S15C2                            BANKMASK(LCDDATA17), 7, b
#define S15C3                            BANKMASK(LCDDATA25), 7, b
#define S15C4                            BANKMASK(LCDDATA33), 7, b
#define S15C5                            BANKMASK(LCDDATA41), 7, b
#define S15C6                            BANKMASK(LCDDATA49), 7, b
#define S15C7                            BANKMASK(LCDDATA57), 7, b
#define S16C0                            BANKMASK(LCDDATA2), 0, b
#define S16C1                            BANKMASK(LCDDATA10), 0, b
#define S16C2                            BANKMASK(LCDDATA18), 0, b
#define S16C3                            BANKMASK(LCDDATA26), 0, b
#define S16C4                            BANKMASK(LCDDATA34), 0, b
#define S16C5                            BANKMASK(LCDDATA42), 0, b
#define S16C6                            BANKMASK(LCDDATA50), 0, b
#define S16C7                            BANKMASK(LCDDATA58), 0, b
#define S17C0                            BANKMASK(LCDDATA2), 1, b
#define S17C1                            BANKMASK(LCDDATA10), 1, b
#define S17C2                            BANKMASK(LCDDATA18), 1, b
#define S17C3                            BANKMASK(LCDDATA26), 1, b
#define S17C4                            BANKMASK(LCDDATA34), 1, b
#define S17C5                            BANKMASK(LCDDATA42), 1, b
#define S17C6                            BANKMASK(LCDDATA50), 1, b
#define S17C7                            BANKMASK(LCDDATA58), 1, b
#define S18C0                            BANKMASK(LCDDATA2), 2, b
#define S18C1                            BANKMASK(LCDDATA10), 2, b
#define S18C2                            BANKMASK(LCDDATA18), 2, b
#define S18C3                            BANKMASK(LCDDATA26), 2, b
#define S18C4                            BANKMASK(LCDDATA34), 2, b
#define S18C5                            BANKMASK(LCDDATA42), 2, b
#define S18C6                            BANKMASK(LCDDATA50), 2, b
#define S18C7                            BANKMASK(LCDDATA58), 2, b
#define S19C0                            BANKMASK(LCDDATA2), 3, b
#define S19C1                            BANKMASK(LCDDATA10), 3, b
#define S19C2                            BANKMASK(LCDDATA18), 3, b
#define S19C3                            BANKMASK(LCDDATA26), 3, b
#define S19C4                            BANKMASK(LCDDATA34), 3, b
#define S19C5                            BANKMASK(LCDDATA42), 3, b
#define S19C6                            BANKMASK(LCDDATA50), 3, b
#define S19C7                            BANKMASK(LCDDATA58), 3, b
#define S20C0                            BANKMASK(LCDDATA2), 4, b
#define S20C1                            BANKMASK(LCDDATA10), 4, b
#define S20C2                            BANKMASK(LCDDATA18), 4, b
#define S20C3                            BANKMASK(LCDDATA26), 4, b
#define S20C4                            BANKMASK(LCDDATA34), 4, b
#define S20C5                            BANKMASK(LCDDATA42), 4, b
#define S20C6                            BANKMASK(LCDDATA50), 4, b
#define S20C7                            BANKMASK(LCDDATA58), 4, b
#define S21C0                            BANKMASK(LCDDATA2), 5, b
#define S21C1                            BANKMASK(LCDDATA10), 5, b
#define S21C2                            BANKMASK(LCDDATA18), 5, b
#define S21C3                            BANKMASK(LCDDATA26), 5, b
#define S21C4                            BANKMASK(LCDDATA34), 5, b
#define S21C5                            BANKMASK(LCDDATA42), 5, b
#define S21C6                            BANKMASK(LCDDATA50), 5, b
#define S21C7                            BANKMASK(LCDDATA58), 5, b
#define S22C0                            BANKMASK(LCDDATA2), 6, b
#define S22C1                            BANKMASK(LCDDATA10), 6, b
#define S22C2                            BANKMASK(LCDDATA18), 6, b
#define S22C3                            BANKMASK(LCDDATA26), 6, b
#define S22C4                            BANKMASK(LCDDATA34), 6, b
#define S22C5                            BANKMASK(LCDDATA42), 6, b
#define S22C6                            BANKMASK(LCDDATA50), 6, b
#define S22C7                            BANKMASK(LCDDATA58), 6, b
#define S23C0                            BANKMASK(LCDDATA2), 7, b
#define S23C1                            BANKMASK(LCDDATA10), 7, b
#define S23C2                            BANKMASK(LCDDATA18), 7, b
#define S23C3                            BANKMASK(LCDDATA26), 7, b
#define S23C4                            BANKMASK(LCDDATA34), 7, b
#define S23C5                            BANKMASK(LCDDATA42), 7, b
#define S23C6                            BANKMASK(LCDDATA50), 7, b
#define S23C7                            BANKMASK(LCDDATA58), 7, b
#define S24C0                            BANKMASK(LCDDATA3), 0, b
#define S24C1                            BANKMASK(LCDDATA11), 0, b
#define S24C2                            BANKMASK(LCDDATA19), 0, b
#define S24C3                            BANKMASK(LCDDATA27), 0, b
#define S24C4                            BANKMASK(LCDDATA35), 0, b
#define S24C5                            BANKMASK(LCDDATA43), 0, b
#define S24C6                            BANKMASK(LCDDATA51), 0, b
#define S24C7                            BANKMASK(LCDDATA59), 0, b
#define S25C0                            BANKMASK(LCDDATA3), 1, b
#define S25C1                            BANKMASK(LCDDATA11), 1, b
#define S25C2                            BANKMASK(LCDDATA19), 1, b
#define S25C3                            BANKMASK(LCDDATA27), 1, b
#define S25C4                            BANKMASK(LCDDATA35), 1, b
#define S25C5                            BANKMASK(LCDDATA43), 1, b
#define S25C6                            BANKMASK(LCDDATA51), 1, b
#define S25C7                            BANKMASK(LCDDATA59), 1, b
#define S26C0                            BANKMASK(LCDDATA3), 2, b
#define S26C1                            BANKMASK(LCDDATA11), 2, b
#define S26C2                            BANKMASK(LCDDATA19), 2, b
#define S26C3                            BANKMASK(LCDDATA27), 2, b
#define S26C4                            BANKMASK(LCDDATA35), 2, b
#define S26C5                            BANKMASK(LCDDATA43), 2, b
#define S26C6                            BANKMASK(LCDDATA51), 2, b
#define S26C7                            BANKMASK(LCDDATA59), 2, b
#define S27C0                            BANKMASK(LCDDATA3), 3, b
#define S27C1                            BANKMASK(LCDDATA11), 3, b
#define S27C2                            BANKMASK(LCDDATA19), 3, b
#define S27C3                            BANKMASK(LCDDATA27), 3, b
#define S27C4                            BANKMASK(LCDDATA35), 3, b
#define S27C5                            BANKMASK(LCDDATA43), 3, b
#define S27C6                            BANKMASK(LCDDATA51), 3, b
#define S27C7                            BANKMASK(LCDDATA59), 3, b
#define S28C0                            BANKMASK(LCDDATA3), 4, b
#define S28C1                            BANKMASK(LCDDATA11), 4, b
#define S28C2                            BANKMASK(LCDDATA19), 4, b
#define S28C3                            BANKMASK(LCDDATA27), 4, b
#define S28C4                            BANKMASK(LCDDATA35), 4, b
#define S28C5                            BANKMASK(LCDDATA43), 4, b
#define S28C6                            BANKMASK(LCDDATA51), 4, b
#define S28C7                            BANKMASK(LCDDATA59), 4, b
#define S29C0                            BANKMASK(LCDDATA3), 5, b
#define S29C1                            BANKMASK(LCDDATA11), 5, b
#define S29C2                            BANKMASK(LCDDATA19), 5, b
#define S29C3                            BANKMASK(LCDDATA27), 5, b
#define S29C4                            BANKMASK(LCDDATA35), 5, b
#define S29C5                            BANKMASK(LCDDATA43), 5, b
#define S29C6                            BANKMASK(LCDDATA51), 5, b
#define S29C7                            BANKMASK(LCDDATA59), 5, b
#define S30C0                            BANKMASK(LCDDATA3), 6, b
#define S30C1                            BANKMASK(LCDDATA11), 6, b
#define S30C2                            BANKMASK(LCDDATA19), 6, b
#define S30C3                            BANKMASK(LCDDATA27), 6, b
#define S30C4                            BANKMASK(LCDDATA35), 6, b
#define S30C5                            BANKMASK(LCDDATA43), 6, b
#define S30C6                            BANKMASK(LCDDATA51), 6, b
#define S30C7                            BANKMASK(LCDDATA59), 6, b
#define S31C0                            BANKMASK(LCDDATA3), 7, b
#define S31C1                            BANKMASK(LCDDATA11), 7, b
#define S31C2                            BANKMASK(LCDDATA19), 7, b
#define S31C3                            BANKMASK(LCDDATA27), 7, b
#define S31C4                            BANKMASK(LCDDATA35), 7, b
#define S31C5                            BANKMASK(LCDDATA43), 7, b
#define S31C6                            BANKMASK(LCDDATA51), 7, b
#define S31C7                            BANKMASK(LCDDATA59), 7, b
#define S32C0                            BANKMASK(LCDDATA4), 0, b
#define S32C1                            BANKMASK(LCDDATA12), 0, b
#define S32C2                            BANKMASK(LCDDATA20), 0, b
#define S32C3                            BANKMASK(LCDDATA28), 0, b
#define S32C4                            BANKMASK(LCDDATA36), 0, b
#define S32C5                            BANKMASK(LCDDATA44), 0, b
#define S32C6                            BANKMASK(LCDDATA52), 0, b
#define S32C7                            BANKMASK(LCDDATA60), 0, b
#define S33C0                            BANKMASK(LCDDATA4), 1, b
#define S33C1                            BANKMASK(LCDDATA12), 1, b
#define S33C2                            BANKMASK(LCDDATA20), 1, b
#define S33C3                            BANKMASK(LCDDATA28), 1, b
#define S33C4                            BANKMASK(LCDDATA36), 1, b
#define S33C5                            BANKMASK(LCDDATA44), 1, b
#define S33C6                            BANKMASK(LCDDATA52), 1, b
#define S33C7                            BANKMASK(LCDDATA60), 1, b
#define S34C0                            BANKMASK(LCDDATA4), 2, b
#define S34C1                            BANKMASK(LCDDATA12), 2, b
#define S34C2                            BANKMASK(LCDDATA20), 2, b
#define S34C3                            BANKMASK(LCDDATA28), 2, b
#define S34C4                            BANKMASK(LCDDATA36), 2, b
#define S34C5                            BANKMASK(LCDDATA44), 2, b
#define S34C6                            BANKMASK(LCDDATA52), 2, b
#define S34C7                            BANKMASK(LCDDATA60), 2, b
#define S35C0                            BANKMASK(LCDDATA4), 3, b
#define S35C1                            BANKMASK(LCDDATA12), 3, b
#define S35C2                            BANKMASK(LCDDATA20), 3, b
#define S35C3                            BANKMASK(LCDDATA28), 3, b
#define S35C4                            BANKMASK(LCDDATA36), 3, b
#define S35C5                            BANKMASK(LCDDATA44), 3, b
#define S35C6                            BANKMASK(LCDDATA52), 3, b
#define S35C7                            BANKMASK(LCDDATA60), 3, b
#define S36C0                            BANKMASK(LCDDATA4), 4, b
#define S36C1                            BANKMASK(LCDDATA12), 4, b
#define S36C2                            BANKMASK(LCDDATA20), 4, b
#define S36C3                            BANKMASK(LCDDATA28), 4, b
#define S36C4                            BANKMASK(LCDDATA36), 4, b
#define S36C5                            BANKMASK(LCDDATA44), 4, b
#define S36C6                            BANKMASK(LCDDATA52), 4, b
#define S36C7                            BANKMASK(LCDDATA60), 4, b
#define S37C0                            BANKMASK(LCDDATA4), 5, b
#define S37C1                            BANKMASK(LCDDATA12), 5, b
#define S37C2                            BANKMASK(LCDDATA20), 5, b
#define S37C3                            BANKMASK(LCDDATA28), 5, b
#define S37C4                            BANKMASK(LCDDATA36), 5, b
#define S37C5                            BANKMASK(LCDDATA44), 5, b
#define S37C6                            BANKMASK(LCDDATA52), 5, b
#define S37C7                            BANKMASK(LCDDATA60), 5, b
#define S38C0                            BANKMASK(LCDDATA4), 6, b
#define S38C1                            BANKMASK(LCDDATA12), 6, b
#define S38C2                            BANKMASK(LCDDATA20), 6, b
#define S38C3                            BANKMASK(LCDDATA28), 6, b
#define S38C4                            BANKMASK(LCDDATA36), 6, b
#define S38C5                            BANKMASK(LCDDATA44), 6, b
#define S38C6                            BANKMASK(LCDDATA52), 6, b
#define S38C7                            BANKMASK(LCDDATA60), 6, b
#define S39C0                            BANKMASK(LCDDATA4), 7, b
#define S39C1                            BANKMASK(LCDDATA12), 7, b
#define S39C2                            BANKMASK(LCDDATA20), 7, b
#define S39C3                            BANKMASK(LCDDATA28), 7, b
#define S39C4                            BANKMASK(LCDDATA36), 7, b
#define S39C5                            BANKMASK(LCDDATA44), 7, b
#define S39C6                            BANKMASK(LCDDATA52), 7, b
#define S39C7                            BANKMASK(LCDDATA60), 7, b
#define S40C0                            BANKMASK(LCDDATA5), 0, b
#define S40C1                            BANKMASK(LCDDATA13), 0, b
#define S40C15                           BANKMASK(LCDDATA5), 0, b
#define S40C2                            BANKMASK(LCDDATA21), 0, b
#define S40C3                            BANKMASK(LCDDATA29), 0, b
#define S40C4                            BANKMASK(LCDDATA37), 0, b
#define S40C5                            BANKMASK(LCDDATA45), 0, b
#define S40C6                            BANKMASK(LCDDATA53), 0, b
#define S40C7                            BANKMASK(LCDDATA61), 0, b
#define S41C0                            BANKMASK(LCDDATA5), 1, b
#define S41C1                            BANKMASK(LCDDATA13), 1, b
#define S41C2                            BANKMASK(LCDDATA21), 1, b
#define S41C3                            BANKMASK(LCDDATA29), 1, b
#define S41C4                            BANKMASK(LCDDATA37), 1, b
#define S41C5                            BANKMASK(LCDDATA45), 1, b
#define S41C6                            BANKMASK(LCDDATA53), 1, b
#define S41C7                            BANKMASK(LCDDATA61), 1, b
#define S42C0                            BANKMASK(LCDDATA5), 2, b
#define S42C1                            BANKMASK(LCDDATA13), 2, b
#define S42C2                            BANKMASK(LCDDATA21), 2, b
#define S42C3                            BANKMASK(LCDDATA29), 2, b
#define S42C4                            BANKMASK(LCDDATA37), 2, b
#define S42C5                            BANKMASK(LCDDATA45), 2, b
#define S42C6                            BANKMASK(LCDDATA53), 2, b
#define S42C7                            BANKMASK(LCDDATA61), 2, b
#define S43C0                            BANKMASK(LCDDATA5), 3, b
#define S43C1                            BANKMASK(LCDDATA13), 3, b
#define S43C2                            BANKMASK(LCDDATA21), 3, b
#define S43C3                            BANKMASK(LCDDATA29), 3, b
#define S43C4                            BANKMASK(LCDDATA37), 3, b
#define S43C5                            BANKMASK(LCDDATA45), 3, b
#define S43C6                            BANKMASK(LCDDATA53), 3, b
#define S43C7                            BANKMASK(LCDDATA61), 3, b
#define S44C0                            BANKMASK(LCDDATA5), 4, b
#define S44C1                            BANKMASK(LCDDATA13), 4, b
#define S44C2                            BANKMASK(LCDDATA21), 4, b
#define S44C3                            BANKMASK(LCDDATA29), 4, b
#define S44C4                            BANKMASK(LCDDATA37), 4, b
#define S44C5                            BANKMASK(LCDDATA45), 4, b
#define S44C6                            BANKMASK(LCDDATA53), 4, b
#define S44C7                            BANKMASK(LCDDATA61), 4, b
#define S45C0                            BANKMASK(LCDDATA5), 5, b
#define S45C1                            BANKMASK(LCDDATA13), 5, b
#define S45C2                            BANKMASK(LCDDATA21), 5, b
#define S45C3                            BANKMASK(LCDDATA29), 5, b
#define S45C4                            BANKMASK(LCDDATA37), 5, b
#define S45C5                            BANKMASK(LCDDATA45), 5, b
#define S45C6                            BANKMASK(LCDDATA53), 5, b
#define S45C7                            BANKMASK(LCDDATA61), 5, b
#define S46C0                            BANKMASK(LCDDATA5), 6, b
#define S46C1                            BANKMASK(LCDDATA13), 6, b
#define S46C2                            BANKMASK(LCDDATA21), 6, b
#define S46C3                            BANKMASK(LCDDATA29), 6, b
#define S46C4                            BANKMASK(LCDDATA37), 6, b
#define S46C5                            BANKMASK(LCDDATA45), 6, b
#define S46C6                            BANKMASK(LCDDATA53), 6, b
#define S46C7                            BANKMASK(LCDDATA61), 6, b
#define S47C0                            BANKMASK(LCDDATA5), 7, b
#define S47C1                            BANKMASK(LCDDATA13), 7, b
#define S47C2                            BANKMASK(LCDDATA21), 7, b
#define S47C3                            BANKMASK(LCDDATA29), 7, b
#define S47C4                            BANKMASK(LCDDATA37), 7, b
#define S47C5                            BANKMASK(LCDDATA45), 7, b
#define S47C6                            BANKMASK(LCDDATA53), 7, b
#define S47C7                            BANKMASK(LCDDATA61), 7, b
#define S48C0                            BANKMASK(LCDDATA6), 0, b
#define S48C1                            BANKMASK(LCDDATA14), 0, b
#define S48C2                            BANKMASK(LCDDATA22), 0, b
