GopalSaraf/Practicals/PSDL/include/proc/pic18f95j94.inc
#define T3GR1                            BANKMASK(RPINR42_43), 1, b
#define T3GR2                            BANKMASK(RPINR42_43), 2, b
#define T3GR3                            BANKMASK(RPINR42_43), 3, b
#define T3GSPM                           BANKMASK(T3GCON), 4, a
#define T3GSS0                           BANKMASK(T3GCON), 0, a
#define T3GSS1                           BANKMASK(T3GCON), 1, a
#define T3GTM                            BANKMASK(T3GCON), 5, a
#define T3GVAL                           BANKMASK(T3GCON), 2, a
#define T3OSCEN                          BANKMASK(T3CON), 3, a
#define T3RD16                           BANKMASK(T3CON), 7, a
#define T4CKPS0                          BANKMASK(T4CON), 0, b
#define T4CKPS016                        BANKMASK(LCDDATA16), 0, b
#define T4CKPS1                          BANKMASK(T4CON), 1, b
#define T4CKPS116                        BANKMASK(LCDDATA16), 1, b
#define T4OUTPS0                         BANKMASK(T4CON), 3, b
#define T4OUTPS016                       BANKMASK(LCDDATA16), 3, b
#define T4OUTPS1                         BANKMASK(T4CON), 4, b
#define T4OUTPS116                       BANKMASK(LCDDATA16), 4, b
#define T4OUTPS2                         BANKMASK(T4CON), 5, b
#define T4OUTPS216                       BANKMASK(LCDDATA16), 5, b
#define T4OUTPS3                         BANKMASK(T4CON), 6, b
#define T4OUTPS316                       BANKMASK(LCDDATA16), 6, b
#define T5CKIR0                          BANKMASK(RPINR44_45), 4, b
#define T5CKIR1                          BANKMASK(RPINR44_45), 5, b
#define T5CKIR2                          BANKMASK(RPINR44_45), 6, b
#define T5CKIR3                          BANKMASK(RPINR44_45), 7, b
#define T5CKPS0                          BANKMASK(T5CON), 4, b
#define T5CKPS1                          BANKMASK(T5CON), 5, b
#define T5GGO                            BANKMASK(T5GCON), 3, b
#define T5GGO_NOT_T5DONE                 BANKMASK(T5GCON), 3, b
#define T5GGO_nT5DONE                    BANKMASK(T5GCON), 3, b
#define T5GPOL                           BANKMASK(T5GCON), 6, b
#define T5GR0                            BANKMASK(RPINR44_45), 0, b
#define T5GR1                            BANKMASK(RPINR44_45), 1, b
#define T5GR2                            BANKMASK(RPINR44_45), 2, b
#define T5GR3                            BANKMASK(RPINR44_45), 3, b
#define T5GSPM                           BANKMASK(T5GCON), 4, b
#define T5GSS0                           BANKMASK(T5GCON), 0, b
#define T5GSS1                           BANKMASK(T5GCON), 1, b
#define T5GTM                            BANKMASK(T5GCON), 5, b
#define T5GVAL                           BANKMASK(T5GCON), 2, b
#define T5OSCEN                          BANKMASK(T5CON), 3, b
#define T5RD16                           BANKMASK(T5CON), 7, b
#define T6CKPS0                          BANKMASK(T6CON), 0, b
#define T6CKPS1                          BANKMASK(T6CON), 1, b
#define T6OUTPS0                         BANKMASK(T6CON), 3, b
#define T6OUTPS1                         BANKMASK(T6CON), 4, b
#define T6OUTPS2                         BANKMASK(T6CON), 5, b
#define T6OUTPS3                         BANKMASK(T6CON), 6, b
#define T8CKPS0                          BANKMASK(T8CON), 0, b
#define T8CKPS1                          BANKMASK(T8CON), 1, b
#define T8OUTPS0                         BANKMASK(T8CON), 3, b
#define T8OUTPS1                         BANKMASK(T8CON), 4, b
#define T8OUTPS2                         BANKMASK(T8CON), 5, b
#define T8OUTPS3                         BANKMASK(T8CON), 6, b
#define TGEN                             BANKMASK(CTMUCON1), 4, b
#define TMR0IE                           BANKMASK(INTCON), 5, a
#define TMR0IF                           BANKMASK(INTCON), 2, a
#define TMR0IP                           BANKMASK(INTCON2), 2, a
#define TMR0MD                           BANKMASK(PMD2), 0, b
#define TMR0ON                           BANKMASK(T0CON), 7, a
#define TMR1CS0                          BANKMASK(T1CON), 6, a
#define TMR1CS1                          BANKMASK(T1CON), 7, a
#define TMR1GE                           BANKMASK(T1GCON), 7, a
#define TMR1GIE                          BANKMASK(PIE1), 2, a
#define TMR1GIF                          BANKMASK(PIR1), 2, a
#define TMR1GIP                          BANKMASK(IPR1), 2, a
#define TMR1IE                           BANKMASK(PIE1), 0, a
#define TMR1IF                           BANKMASK(PIR1), 0, a
#define TMR1IP                           BANKMASK(IPR1), 0, a
#define TMR1MD                           BANKMASK(PMD2), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE1), 1, a
#define TMR2IF                           BANKMASK(PIR1), 1, a
#define TMR2IP                           BANKMASK(IPR1), 1, a
#define TMR2MD                           BANKMASK(PMD2), 2, b
#define TMR2ON                           BANKMASK(T2CON), 2, a
#define TMR3CS0                          BANKMASK(T3CON), 6, a
#define TMR3CS019                        BANKMASK(LCDDATA19), 6, b
#define TMR3CS1                          BANKMASK(T3CON), 7, a
#define TMR3CS119                        BANKMASK(LCDDATA19), 7, b
#define TMR3GE                           BANKMASK(T3GCON), 7, a
#define TMR3GIE                          BANKMASK(PIE2), 0, a
#define TMR3GIF                          BANKMASK(PIR2), 0, a
#define TMR3GIP                          BANKMASK(IPR2), 0, a
#define TMR3IE                           BANKMASK(PIE2), 1, a
#define TMR3IF                           BANKMASK(PIR2), 1, a
#define TMR3IP                           BANKMASK(IPR2), 1, a
#define TMR3MD                           BANKMASK(PMD2), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TMR4IE                           BANKMASK(PIE5), 0, a
#define TMR4IF                           BANKMASK(PIR5), 0, a
#define TMR4IP                           BANKMASK(IPR5), 0, a
#define TMR4MD                           BANKMASK(PMD2), 4, b
#define TMR4ON                           BANKMASK(T4CON), 2, b
#define TMR5CS0                          BANKMASK(T5CON), 6, b
#define TMR5CS1                          BANKMASK(T5CON), 7, b
#define TMR5GE                           BANKMASK(T5GCON), 7, b
#define TMR5GIE                          BANKMASK(PIE3), 7, a
#define TMR5GIF                          BANKMASK(PIR3), 7, a
#define TMR5GIP                          BANKMASK(IPR3), 7, a
#define TMR5IE                           BANKMASK(PIE5), 1, a
#define TMR5IF                           BANKMASK(PIR5), 1, a
#define TMR5IP                           BANKMASK(IPR5), 1, a
#define TMR5MD                           BANKMASK(PMD2), 5, b
#define TMR5ON                           BANKMASK(T5CON), 0, b
#define TMR6IE                           BANKMASK(PIE5), 2, a
#define TMR6IF                           BANKMASK(PIR5), 2, a
#define TMR6IP                           BANKMASK(IPR5), 2, a
#define TMR6MD                           BANKMASK(PMD2), 6, b
#define TMR6ON                           BANKMASK(T6CON), 2, b
#define TMR8IE                           BANKMASK(PIE5), 4, a
#define TMR8IF                           BANKMASK(PIR5), 4, a
#define TMR8IP                           BANKMASK(IPR5), 4, a
#define TMR8MD                           BANKMASK(PMD2), 7, b
#define TMR8ON                           BANKMASK(T8CON), 2, b
#define TO                               BANKMASK(RCON), 3, a
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRISD0                           BANKMASK(TRISD), 0, a
#define TRISD1                           BANKMASK(TRISD), 1, a
#define TRISD2                           BANKMASK(TRISD), 2, a
#define TRISD3                           BANKMASK(TRISD), 3, a
#define TRISD4                           BANKMASK(TRISD), 4, a
#define TRISD5                           BANKMASK(TRISD), 5, a
#define TRISD6                           BANKMASK(TRISD), 6, a
#define TRISD7                           BANKMASK(TRISD), 7, a
#define TRISE0                           BANKMASK(TRISE), 0, a
#define TRISE1                           BANKMASK(TRISE), 1, a
#define TRISE2                           BANKMASK(TRISE), 2, a
#define TRISE3                           BANKMASK(TRISE), 3, a
#define TRISE4                           BANKMASK(TRISE), 4, a
#define TRISE5                           BANKMASK(TRISE), 5, a
#define TRISE6                           BANKMASK(TRISE), 6, a
#define TRISE7                           BANKMASK(TRISE), 7, a
#define TRISF2                           BANKMASK(TRISF), 2, a
#define TRISF3                           BANKMASK(TRISF), 3, a
#define TRISF4                           BANKMASK(TRISF), 4, a
#define TRISF5                           BANKMASK(TRISF), 5, a
#define TRISF6                           BANKMASK(TRISF), 6, a
#define TRISF7                           BANKMASK(TRISF), 7, a
#define TRISG0                           BANKMASK(TRISG), 0, a
#define TRISG1                           BANKMASK(TRISG), 1, a
#define TRISG2                           BANKMASK(TRISG), 2, a
#define TRISG3                           BANKMASK(TRISG), 3, a
#define TRISG4                           BANKMASK(TRISG), 4, a
#define TRISG6                           BANKMASK(TRISG), 6, a
#define TRISG7                           BANKMASK(TRISG), 7, a
#define TRISH0                           BANKMASK(TRISH), 0, a
#define TRISH1                           BANKMASK(TRISH), 1, a
#define TRISH2                           BANKMASK(TRISH), 2, a
#define TRISH3                           BANKMASK(TRISH), 3, a
#define TRISH4                           BANKMASK(TRISH), 4, a
#define TRISH5                           BANKMASK(TRISH), 5, a
#define TRISH6                           BANKMASK(TRISH), 6, a
#define TRISH7                           BANKMASK(TRISH), 7, a
#define TRISJ0                           BANKMASK(TRISJ), 0, a
#define TRISJ1                           BANKMASK(TRISJ), 1, a
#define TRISJ2                           BANKMASK(TRISJ), 2, a
#define TRISJ3                           BANKMASK(TRISJ), 3, a
#define TRISJ4                           BANKMASK(TRISJ), 4, a
#define TRISJ5                           BANKMASK(TRISJ), 5, a
#define TRISJ6                           BANKMASK(TRISJ), 6, a
#define TRISJ7                           BANKMASK(TRISJ), 7, a
#define TRISK0                           BANKMASK(TRISK), 0, b
#define TRISK1                           BANKMASK(TRISK), 1, b
#define TRISK2                           BANKMASK(TRISK), 2, b
#define TRISK3                           BANKMASK(TRISK), 3, b
#define TRISK4                           BANKMASK(TRISK), 4, b
#define TRISK5                           BANKMASK(TRISK), 5, b
#define TRISK6                           BANKMASK(TRISK), 6, b
#define TRISK7                           BANKMASK(TRISK), 7, b
#define TRISL0                           BANKMASK(TRISL), 0, b
#define TRISL1                           BANKMASK(TRISL), 1, b
#define TRISL2                           BANKMASK(TRISL), 2, b
#define TRISL3                           BANKMASK(TRISL), 3, b
#define TRISL4                           BANKMASK(TRISL), 4, b
#define TRISL5                           BANKMASK(TRISL), 5, b
#define TRISL6                           BANKMASK(TRISL), 6, b
#define TRISL7                           BANKMASK(TRISL), 7, b
#define TRISVP0                          BANKMASK(TRISVP), 0, a
#define TRISVP1                          BANKMASK(TRISVP), 1, a
#define TRISVP2                          BANKMASK(TRISVP), 2, a
#define TRISVP3                          BANKMASK(TRISVP), 3, a
#define TRISVP4                          BANKMASK(TRISVP), 4, a
#define TRISVP5                          BANKMASK(TRISVP), 5, a
#define TRISVP6                          BANKMASK(TRISVP), 6, a
#define TRISVP7                          BANKMASK(TRISVP), 7, a
#define TRMT1                            BANKMASK(TXSTA1), 1, a
#define TRNIE                            BANKMASK(UIE), 3, b
#define TRNIF                            BANKMASK(UIR), 3, a
#define TUN0                             BANKMASK(OSCTUNE), 0, a
#define TUN1                             BANKMASK(OSCTUNE), 1, a
#define TUN2                             BANKMASK(OSCTUNE), 2, a
#define TUN3                             BANKMASK(OSCTUNE), 3, a
#define TUN4                             BANKMASK(OSCTUNE), 4, a
#define TUN5                             BANKMASK(OSCTUNE), 5, a
#define TX1IE                            BANKMASK(PIE1), 4, a
#define TX1IF                            BANKMASK(PIR1), 4, a
#define TX1IP                            BANKMASK(IPR1), 4, a
#define TX2IE                            BANKMASK(PIE3), 4, a
#define TX2IF                            BANKMASK(PIR3), 4, a
#define TX2IP                            BANKMASK(IPR3), 4, a
#define TX3IE                            BANKMASK(PIE6), 4, a
#define TX3IF                            BANKMASK(PIR6), 4, a
#define TX3IP                            BANKMASK(IPR6), 4, a
#define TX4IE                            BANKMASK(PIE6), 6, a
#define TX4IF                            BANKMASK(PIR6), 6, a
#define TX4IP                            BANKMASK(IPR6), 6, a
#define TX8_9                            BANKMASK(TXSTA1), 6, a
#define TX8_92                           BANKMASK(TXSTA2), 6, b
#define TX8_93                           BANKMASK(TXSTA3), 6, b
#define TX8_94                           BANKMASK(TXSTA4), 6, b
#define TX91                             BANKMASK(TXSTA1), 6, a
#define TX9D1                            BANKMASK(TXSTA1), 0, a
#define TXADDR0                          BANKMASK(TXADDRL), 0, a
#define TXADDR1                          BANKMASK(TXADDRL), 1, a
#define TXADDR10                         BANKMASK(TXADDRH), 2, a
#define TXADDR11                         BANKMASK(TXADDRH), 3, a
#define TXADDR2                          BANKMASK(TXADDRL), 2, a
#define TXADDR3                          BANKMASK(TXADDRL), 3, a
#define TXADDR4                          BANKMASK(TXADDRL), 4, a
#define TXADDR5                          BANKMASK(TXADDRL), 5, a
#define TXADDR6                          BANKMASK(TXADDRL), 6, a
#define TXADDR7                          BANKMASK(TXADDRL), 7, a
#define TXADDR8                          BANKMASK(TXADDRH), 0, a
#define TXADDR9                          BANKMASK(TXADDRH), 1, a
#define TXB0IE                           BANKMASK(PIE3), 2, a
#define TXB1IE                           BANKMASK(PIE3), 3, a
#define TXB2IE                           BANKMASK(PIE3), 4, a
#define TXBNIE                           BANKMASK(PIE3), 4, a
#define TXBNIF                           BANKMASK(PIR3), 4, a
#define TXBNIP                           BANKMASK(IPR3), 4, a
#define TXBUF0                           BANKMASK(TXBUF), 0, a
#define TXBUF1                           BANKMASK(TXBUF), 1, a
#define TXBUF2                           BANKMASK(TXBUF), 2, a
#define TXBUF3                           BANKMASK(TXBUF), 3, a
#define TXBUF4                           BANKMASK(TXBUF), 4, a
#define TXBUF5                           BANKMASK(TXBUF), 5, a
#define TXBUF6                           BANKMASK(TXBUF), 6, a
#define TXBUF7                           BANKMASK(TXBUF), 7, a
#define TXCKP1                           BANKMASK(BAUDCON1), 4, a
#define TXCKP2                           BANKMASK(BAUDCON2), 4, b
#define TXCKP3                           BANKMASK(BAUDCON3), 4, b
#define TXCKP4                           BANKMASK(BAUDCON4), 4, b
#define TXD8                             BANKMASK(TXSTA1), 0, a
#define TXD82                            BANKMASK(TXSTA2), 0, b
#define TXD83                            BANKMASK(TXSTA3), 0, b
#define TXD84                            BANKMASK(TXSTA4), 0, b
#define TXEN1                            BANKMASK(TXSTA1), 5, a
#define TXIE                             BANKMASK(PIE1), 4, a
#define TXIF                             BANKMASK(PIR1), 4, a
#define TXINC                            BANKMASK(DMACON1), 5, a
#define TXMMD                            BANKMASK(PMD3), 7, b
#define U1RXR0                           BANKMASK(RPINR0_1), 0, b
#define U1RXR1                           BANKMASK(RPINR0_1), 1, b
#define U1RXR2                           BANKMASK(RPINR0_1), 2, b
#define U1RXR3                           BANKMASK(RPINR0_1), 3, b
#define U1TXR0                           BANKMASK(RPINR0_1), 4, b
#define U1TXR1                           BANKMASK(RPINR0_1), 5, b
#define U1TXR2                           BANKMASK(RPINR0_1), 6, b
#define U1TXR3                           BANKMASK(RPINR0_1), 7, b
#define U2RXR0                           BANKMASK(RPINR2_3), 0, b
#define U2RXR1                           BANKMASK(RPINR2_3), 1, b
#define U2RXR2                           BANKMASK(RPINR2_3), 2, b
#define U2RXR3                           BANKMASK(RPINR2_3), 3, b
#define U2TXR0                           BANKMASK(RPINR2_3), 4, b
#define U2TXR1                           BANKMASK(RPINR2_3), 5, b
#define U2TXR2                           BANKMASK(RPINR2_3), 6, b
#define U2TXR3                           BANKMASK(RPINR2_3), 7, b
#define U3RXR0                           BANKMASK(RPINR4_5), 0, b
#define U3RXR1                           BANKMASK(RPINR4_5), 1, b
#define U3RXR2                           BANKMASK(RPINR4_5), 2, b
#define U3RXR3                           BANKMASK(RPINR4_5), 3, b
#define U3TXR0                           BANKMASK(RPINR4_5), 4, b
#define U3TXR1                           BANKMASK(RPINR4_5), 5, b
#define U3TXR2                           BANKMASK(RPINR4_5), 6, b
#define U3TXR3                           BANKMASK(RPINR4_5), 7, b
#define U4RXR0                           BANKMASK(RPINR6_7), 0, b
#define U4RXR1                           BANKMASK(RPINR6_7), 1, b
#define U4RXR2                           BANKMASK(RPINR6_7), 2, b
#define U4RXR3                           BANKMASK(RPINR6_7), 3, b
#define U4TXR0                           BANKMASK(RPINR6_7), 4, b
#define U4TXR1                           BANKMASK(RPINR6_7), 5, b
#define U4TXR2                           BANKMASK(RPINR6_7), 6, b
#define U4TXR3                           BANKMASK(RPINR6_7), 7, b
#define UA1                              BANKMASK(SSP1STAT), 1, a
#define UA2                              BANKMASK(SSP2STAT), 1, b
#define UART1MD                          BANKMASK(PMD1), 2, b
#define UART2MD                          BANKMASK(PMD1), 3, b
#define UART3MD                          BANKMASK(PMD1), 4, b
#define UART4MD                          BANKMASK(PMD1), 5, b
#define UERRIE                           BANKMASK(UIE), 1, b
#define UERRIF                           BANKMASK(UIR), 1, a
#define ULPWDIS                          BANKMASK(DSCONL), 2, b
#define ULPWUIN                          BANKMASK(PORTA), 0, a
#define UOEMON                           BANKMASK(UCFG), 6, b
#define UPP0                             BANKMASK(UCFG), 0, b
#define UPP1                             BANKMASK(UCFG), 1, b
#define UPUEN                            BANKMASK(UCFG), 4, b
#define URSTIE                           BANKMASK(UIE), 0, b
#define URSTIF                           BANKMASK(UIR), 0, a
#define USART1OD                         BANKMASK(ODCON1), 2, b
#define USART2OD                         BANKMASK(ODCON1), 3, b
#define USART3OD                         BANKMASK(ODCON1), 4, b
#define USART4OD                         BANKMASK(ODCON1), 5, b
#define USBEN                            BANKMASK(UCON), 3, a
#define USBIE                            BANKMASK(PIE2), 4, a
#define USBIF                            BANKMASK(PIR2), 4, a
#define USBIP                            BANKMASK(IPR2), 4, a
#define USBMD                            BANKMASK(PMD4), 4, b
#define UTEYE                            BANKMASK(UCFG), 7, b
#define UTRDIS                           BANKMASK(UCFG), 3, b
#define VBAT                             BANKMASK(RCON3), 0, a
#define VBG2EN                           BANKMASK(ANCFG), 1, b
#define VBG6EN                           BANKMASK(ANCFG), 2, b
#define VBGEN                            BANKMASK(ANCFG), 0, b
#define VBPOR                            BANKMASK(RCON3), 1, a
#define VDDBOR                           BANKMASK(RCON3), 3, a
#define VDDPOR                           BANKMASK(RCON3), 2, a
#define VDIRMAG                          BANKMASK(HLVDCON), 7, a
#define VLCD1PE                          BANKMASK(LCDREF), 0, b
#define VLCD2PE                          BANKMASK(LCDREF), 1, b
#define VLCD3PE                          BANKMASK(LCDREF), 2, b
#define WA                               BANKMASK(LCDPS), 4, b
#define WAIT0                            BANKMASK(MEMCON), 4, b
#define WAIT1                            BANKMASK(MEMCON), 5, b
#define WAITB0                           BANKMASK(RTCVALH), 6, b
#define WAITB1                           BANKMASK(RTCVALH), 7, b
#define WAITE0                           BANKMASK(RTCVALH), 0, b
#define WAITE1                           BANKMASK(RTCVALH), 1, b
#define WAITM0                           BANKMASK(RTCVALH), 2, b
#define WAITM1                           BANKMASK(RTCVALH), 3, b
#define WAITM2                           BANKMASK(RTCVALH), 4, b
#define WAITM3                           BANKMASK(RTCVALH), 5, b
#define WCOL1                            BANKMASK(SSP1CON1), 7, a
#define WCOL2                            BANKMASK(SSP2CON1), 7, b
#define WERR                             BANKMASK(LCDCON), 5, b
#define WFT                              BANKMASK(LCDPS), 7, b
#define WPUB0                            BANKMASK(WPUB), 0, a
#define WPUB1                            BANKMASK(WPUB), 1, a
#define WPUB2                            BANKMASK(WPUB), 2, a
#define WPUB3                            BANKMASK(WPUB), 3, a
#define WPUB4                            BANKMASK(WPUB), 4, a
#define WPUB5                            BANKMASK(WPUB), 5, a
#define WPUB6                            BANKMASK(WPUB), 6, a
#define WPUB7                            BANKMASK(WPUB), 7, a
#define WR                               BANKMASK(EECON1), 1, a
#define WRE                              BANKMASK(PORTE), 1, a
#define WREN                             BANKMASK(EECON1), 2, a
#define WRERR                            BANKMASK(EECON1), 3, a
#define WUE1                             BANKMASK(BAUDCON1), 1, a
#define WUE2                             BANKMASK(BAUDCON2), 1, b
#define WUE3                             BANKMASK(BAUDCON3), 1, b
#define WUE4                             BANKMASK(BAUDCON4), 1, b
